Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x4ed (32-bit)
   Version:       4
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (indirect string, offset: 0x3e72a): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (indirect string, offset: 0x6d38d): ../Core/Src/main.c
    <15>   DW_AT_comp_dir    : (indirect string, offset: 0x38bca): D:/github/mc/stm32/test2/test2/Debug
    <19>   DW_AT_ranges      : 0x0
    <1d>   DW_AT_low_pc      : 0x0
    <21>   DW_AT_stmt_list   : 0x0
    <25>   DW_AT_GNU_macros  : 0x0
 <1><29>: Abbrev Number: 2 (DW_TAG_base_type)
    <2a>   DW_AT_byte_size   : 1
    <2b>   DW_AT_encoding    : 6	(signed char)
    <2c>   DW_AT_name        : (indirect string, offset: 0x3da6f): signed char
 <1><30>: Abbrev Number: 2 (DW_TAG_base_type)
    <31>   DW_AT_byte_size   : 1
    <32>   DW_AT_encoding    : 8	(unsigned char)
    <33>   DW_AT_name        : (indirect string, offset: 0x1917f): unsigned char
 <1><37>: Abbrev Number: 2 (DW_TAG_base_type)
    <38>   DW_AT_byte_size   : 2
    <39>   DW_AT_encoding    : 5	(signed)
    <3a>   DW_AT_name        : (indirect string, offset: 0x5b49f): short int
 <1><3e>: Abbrev Number: 3 (DW_TAG_typedef)
    <3f>   DW_AT_name        : (indirect string, offset: 0x646d1): __uint16_t
    <43>   DW_AT_decl_file   : 3
    <44>   DW_AT_decl_line   : 57
    <45>   DW_AT_decl_column : 25
    <46>   DW_AT_type        : <0x4a>
 <1><4a>: Abbrev Number: 2 (DW_TAG_base_type)
    <4b>   DW_AT_byte_size   : 2
    <4c>   DW_AT_encoding    : 7	(unsigned)
    <4d>   DW_AT_name        : (indirect string, offset: 0x286aa): short unsigned int
 <1><51>: Abbrev Number: 2 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 4
    <53>   DW_AT_encoding    : 5	(signed)
    <54>   DW_AT_name        : (indirect string, offset: 0xaa54): long int
 <1><58>: Abbrev Number: 3 (DW_TAG_typedef)
    <59>   DW_AT_name        : (indirect string, offset: 0x4e26e): __uint32_t
    <5d>   DW_AT_decl_file   : 3
    <5e>   DW_AT_decl_line   : 79
    <5f>   DW_AT_decl_column : 25
    <60>   DW_AT_type        : <0x64>
 <1><64>: Abbrev Number: 2 (DW_TAG_base_type)
    <65>   DW_AT_byte_size   : 4
    <66>   DW_AT_encoding    : 7	(unsigned)
    <67>   DW_AT_name        : (indirect string, offset: 0x1d0e9): long unsigned int
 <1><6b>: Abbrev Number: 2 (DW_TAG_base_type)
    <6c>   DW_AT_byte_size   : 8
    <6d>   DW_AT_encoding    : 5	(signed)
    <6e>   DW_AT_name        : (indirect string, offset: 0x38898): long long int
 <1><72>: Abbrev Number: 2 (DW_TAG_base_type)
    <73>   DW_AT_byte_size   : 8
    <74>   DW_AT_encoding    : 7	(unsigned)
    <75>   DW_AT_name        : (indirect string, offset: 0x1992d): long long unsigned int
 <1><79>: Abbrev Number: 4 (DW_TAG_base_type)
    <7a>   DW_AT_byte_size   : 4
    <7b>   DW_AT_encoding    : 5	(signed)
    <7c>   DW_AT_name        : int
 <1><80>: Abbrev Number: 2 (DW_TAG_base_type)
    <81>   DW_AT_byte_size   : 4
    <82>   DW_AT_encoding    : 7	(unsigned)
    <83>   DW_AT_name        : (indirect string, offset: 0xa417): unsigned int
 <1><87>: Abbrev Number: 3 (DW_TAG_typedef)
    <88>   DW_AT_name        : (indirect string, offset: 0x646d3): uint16_t
    <8c>   DW_AT_decl_file   : 4
    <8d>   DW_AT_decl_line   : 36
    <8e>   DW_AT_decl_column : 20
    <8f>   DW_AT_type        : <0x3e>
 <1><93>: Abbrev Number: 3 (DW_TAG_typedef)
    <94>   DW_AT_name        : (indirect string, offset: 0x4e270): uint32_t
    <98>   DW_AT_decl_file   : 4
    <99>   DW_AT_decl_line   : 48
    <9a>   DW_AT_decl_column : 20
    <9b>   DW_AT_type        : <0x58>
 <1><9f>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <a0>   DW_AT_type        : <0x93>
 <1><a4>: Abbrev Number: 6 (DW_TAG_structure_type)
    <a5>   DW_AT_byte_size   : 28
    <a6>   DW_AT_decl_file   : 5
    <a7>   DW_AT_decl_line   : 358
    <a9>   DW_AT_decl_column : 9
    <aa>   DW_AT_sibling     : <0x111>
 <2><ae>: Abbrev Number: 7 (DW_TAG_member)
    <af>   DW_AT_name        : CRL
    <b3>   DW_AT_decl_file   : 5
    <b4>   DW_AT_decl_line   : 360
    <b6>   DW_AT_decl_column : 17
    <b7>   DW_AT_type        : <0x9f>
    <bb>   DW_AT_data_member_location: 0
 <2><bc>: Abbrev Number: 7 (DW_TAG_member)
    <bd>   DW_AT_name        : CRH
    <c1>   DW_AT_decl_file   : 5
    <c2>   DW_AT_decl_line   : 361
    <c4>   DW_AT_decl_column : 17
    <c5>   DW_AT_type        : <0x9f>
    <c9>   DW_AT_data_member_location: 4
 <2><ca>: Abbrev Number: 7 (DW_TAG_member)
    <cb>   DW_AT_name        : IDR
    <cf>   DW_AT_decl_file   : 5
    <d0>   DW_AT_decl_line   : 362
    <d2>   DW_AT_decl_column : 17
    <d3>   DW_AT_type        : <0x9f>
    <d7>   DW_AT_data_member_location: 8
 <2><d8>: Abbrev Number: 7 (DW_TAG_member)
    <d9>   DW_AT_name        : ODR
    <dd>   DW_AT_decl_file   : 5
    <de>   DW_AT_decl_line   : 363
    <e0>   DW_AT_decl_column : 17
    <e1>   DW_AT_type        : <0x9f>
    <e5>   DW_AT_data_member_location: 12
 <2><e6>: Abbrev Number: 8 (DW_TAG_member)
    <e7>   DW_AT_name        : (indirect string, offset: 0x1b988): BSRR
    <eb>   DW_AT_decl_file   : 5
    <ec>   DW_AT_decl_line   : 364
    <ee>   DW_AT_decl_column : 17
    <ef>   DW_AT_type        : <0x9f>
    <f3>   DW_AT_data_member_location: 16
 <2><f4>: Abbrev Number: 7 (DW_TAG_member)
    <f5>   DW_AT_name        : BRR
    <f9>   DW_AT_decl_file   : 5
    <fa>   DW_AT_decl_line   : 365
    <fc>   DW_AT_decl_column : 17
    <fd>   DW_AT_type        : <0x9f>
    <101>   DW_AT_data_member_location: 20
 <2><102>: Abbrev Number: 8 (DW_TAG_member)
    <103>   DW_AT_name        : (indirect string, offset: 0x6955d): LCKR
    <107>   DW_AT_decl_file   : 5
    <108>   DW_AT_decl_line   : 366
    <10a>   DW_AT_decl_column : 17
    <10b>   DW_AT_type        : <0x9f>
    <10f>   DW_AT_data_member_location: 24
 <2><110>: Abbrev Number: 0
 <1><111>: Abbrev Number: 9 (DW_TAG_typedef)
    <112>   DW_AT_name        : (indirect string, offset: 0x76640): GPIO_TypeDef
    <116>   DW_AT_decl_file   : 5
    <117>   DW_AT_decl_line   : 367
    <119>   DW_AT_decl_column : 3
    <11a>   DW_AT_type        : <0xa4>
 <1><11e>: Abbrev Number: 6 (DW_TAG_structure_type)
    <11f>   DW_AT_byte_size   : 40
    <120>   DW_AT_decl_file   : 5
    <121>   DW_AT_decl_line   : 424
    <123>   DW_AT_decl_column : 9
    <124>   DW_AT_sibling     : <0x1b4>
 <2><128>: Abbrev Number: 7 (DW_TAG_member)
    <129>   DW_AT_name        : CR
    <12c>   DW_AT_decl_file   : 5
    <12d>   DW_AT_decl_line   : 426
    <12f>   DW_AT_decl_column : 17
    <130>   DW_AT_type        : <0x9f>
    <134>   DW_AT_data_member_location: 0
 <2><135>: Abbrev Number: 8 (DW_TAG_member)
    <136>   DW_AT_name        : (indirect string, offset: 0x4aa9e): CFGR
    <13a>   DW_AT_decl_file   : 5
    <13b>   DW_AT_decl_line   : 427
    <13d>   DW_AT_decl_column : 17
    <13e>   DW_AT_type        : <0x9f>
    <142>   DW_AT_data_member_location: 4
 <2><143>: Abbrev Number: 7 (DW_TAG_member)
    <144>   DW_AT_name        : CIR
    <148>   DW_AT_decl_file   : 5
    <149>   DW_AT_decl_line   : 428
    <14b>   DW_AT_decl_column : 17
    <14c>   DW_AT_type        : <0x9f>
    <150>   DW_AT_data_member_location: 8
 <2><151>: Abbrev Number: 8 (DW_TAG_member)
    <152>   DW_AT_name        : (indirect string, offset: 0x35c15): APB2RSTR
    <156>   DW_AT_decl_file   : 5
    <157>   DW_AT_decl_line   : 429
    <159>   DW_AT_decl_column : 17
    <15a>   DW_AT_type        : <0x9f>
    <15e>   DW_AT_data_member_location: 12
 <2><15f>: Abbrev Number: 8 (DW_TAG_member)
    <160>   DW_AT_name        : (indirect string, offset: 0xe01d): APB1RSTR
    <164>   DW_AT_decl_file   : 5
    <165>   DW_AT_decl_line   : 430
    <167>   DW_AT_decl_column : 17
    <168>   DW_AT_type        : <0x9f>
    <16c>   DW_AT_data_member_location: 16
 <2><16d>: Abbrev Number: 8 (DW_TAG_member)
    <16e>   DW_AT_name        : (indirect string, offset: 0xb7d8): AHBENR
    <172>   DW_AT_decl_file   : 5
    <173>   DW_AT_decl_line   : 431
    <175>   DW_AT_decl_column : 17
    <176>   DW_AT_type        : <0x9f>
    <17a>   DW_AT_data_member_location: 20
 <2><17b>: Abbrev Number: 8 (DW_TAG_member)
    <17c>   DW_AT_name        : (indirect string, offset: 0xe9b5): APB2ENR
    <180>   DW_AT_decl_file   : 5
    <181>   DW_AT_decl_line   : 432
    <183>   DW_AT_decl_column : 17
    <184>   DW_AT_type        : <0x9f>
    <188>   DW_AT_data_member_location: 24
 <2><189>: Abbrev Number: 8 (DW_TAG_member)
    <18a>   DW_AT_name        : (indirect string, offset: 0x5c337): APB1ENR
    <18e>   DW_AT_decl_file   : 5
    <18f>   DW_AT_decl_line   : 433
    <191>   DW_AT_decl_column : 17
    <192>   DW_AT_type        : <0x9f>
    <196>   DW_AT_data_member_location: 28
 <2><197>: Abbrev Number: 8 (DW_TAG_member)
    <198>   DW_AT_name        : (indirect string, offset: 0x11037): BDCR
    <19c>   DW_AT_decl_file   : 5
    <19d>   DW_AT_decl_line   : 434
    <19f>   DW_AT_decl_column : 17
    <1a0>   DW_AT_type        : <0x9f>
    <1a4>   DW_AT_data_member_location: 32
 <2><1a5>: Abbrev Number: 7 (DW_TAG_member)
    <1a6>   DW_AT_name        : CSR
    <1aa>   DW_AT_decl_file   : 5
    <1ab>   DW_AT_decl_line   : 435
    <1ad>   DW_AT_decl_column : 17
    <1ae>   DW_AT_type        : <0x9f>
    <1b2>   DW_AT_data_member_location: 36
 <2><1b3>: Abbrev Number: 0
 <1><1b4>: Abbrev Number: 9 (DW_TAG_typedef)
    <1b5>   DW_AT_name        : (indirect string, offset: 0x39663): RCC_TypeDef
    <1b9>   DW_AT_decl_file   : 5
    <1ba>   DW_AT_decl_line   : 438
    <1bc>   DW_AT_decl_column : 3
    <1bd>   DW_AT_type        : <0x11e>
 <1><1c1>: Abbrev Number: 2 (DW_TAG_base_type)
    <1c2>   DW_AT_byte_size   : 8
    <1c3>   DW_AT_encoding    : 4	(float)
    <1c4>   DW_AT_name        : (indirect string, offset: 0x13834): long double
 <1><1c8>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <1c9>   DW_AT_encoding    : 7	(unsigned)
    <1ca>   DW_AT_byte_size   : 1
    <1cb>   DW_AT_type        : <0x30>
    <1cf>   DW_AT_decl_file   : 6
    <1d0>   DW_AT_decl_line   : 40
    <1d1>   DW_AT_decl_column : 1
    <1d2>   DW_AT_sibling     : <0x1ef>
 <2><1d6>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1d7>   DW_AT_name        : (indirect string, offset: 0x29a90): HAL_OK
    <1db>   DW_AT_const_value : 0
 <2><1dc>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1dd>   DW_AT_name        : (indirect string, offset: 0x4ccd0): HAL_ERROR
    <1e1>   DW_AT_const_value : 1
 <2><1e2>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1e3>   DW_AT_name        : (indirect string, offset: 0x15966): HAL_BUSY
    <1e7>   DW_AT_const_value : 2
 <2><1e8>: Abbrev Number: 11 (DW_TAG_enumerator)
    <1e9>   DW_AT_name        : (indirect string, offset: 0x2453e): HAL_TIMEOUT
    <1ed>   DW_AT_const_value : 3
 <2><1ee>: Abbrev Number: 0
 <1><1ef>: Abbrev Number: 3 (DW_TAG_typedef)
    <1f0>   DW_AT_name        : (indirect string, offset: 0x1567): HAL_StatusTypeDef
    <1f4>   DW_AT_decl_file   : 6
    <1f5>   DW_AT_decl_line   : 45
    <1f6>   DW_AT_decl_column : 3
    <1f7>   DW_AT_type        : <0x1c8>
 <1><1fb>: Abbrev Number: 12 (DW_TAG_structure_type)
    <1fc>   DW_AT_byte_size   : 12
    <1fd>   DW_AT_decl_file   : 7
    <1fe>   DW_AT_decl_line   : 49
    <1ff>   DW_AT_decl_column : 9
    <200>   DW_AT_sibling     : <0x22c>
 <2><204>: Abbrev Number: 13 (DW_TAG_member)
    <205>   DW_AT_name        : (indirect string, offset: 0x528a8): PLLState
    <209>   DW_AT_decl_file   : 7
    <20a>   DW_AT_decl_line   : 51
    <20b>   DW_AT_decl_column : 12
    <20c>   DW_AT_type        : <0x93>
    <210>   DW_AT_data_member_location: 0
 <2><211>: Abbrev Number: 13 (DW_TAG_member)
    <212>   DW_AT_name        : (indirect string, offset: 0x53b21): PLLSource
    <216>   DW_AT_decl_file   : 7
    <217>   DW_AT_decl_line   : 54
    <218>   DW_AT_decl_column : 12
    <219>   DW_AT_type        : <0x93>
    <21d>   DW_AT_data_member_location: 4
 <2><21e>: Abbrev Number: 13 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0x6e0a5): PLLMUL
    <223>   DW_AT_decl_file   : 7
    <224>   DW_AT_decl_line   : 57
    <225>   DW_AT_decl_column : 12
    <226>   DW_AT_type        : <0x93>
    <22a>   DW_AT_data_member_location: 8
 <2><22b>: Abbrev Number: 0
 <1><22c>: Abbrev Number: 3 (DW_TAG_typedef)
    <22d>   DW_AT_name        : (indirect string, offset: 0x4a7ea): RCC_PLLInitTypeDef
    <231>   DW_AT_decl_file   : 7
    <232>   DW_AT_decl_line   : 59
    <233>   DW_AT_decl_column : 3
    <234>   DW_AT_type        : <0x1fb>
 <1><238>: Abbrev Number: 12 (DW_TAG_structure_type)
    <239>   DW_AT_byte_size   : 20
    <23a>   DW_AT_decl_file   : 7
    <23b>   DW_AT_decl_line   : 64
    <23c>   DW_AT_decl_column : 9
    <23d>   DW_AT_sibling     : <0x283>
 <2><241>: Abbrev Number: 13 (DW_TAG_member)
    <242>   DW_AT_name        : (indirect string, offset: 0x25e23): ClockType
    <246>   DW_AT_decl_file   : 7
    <247>   DW_AT_decl_line   : 66
    <248>   DW_AT_decl_column : 12
    <249>   DW_AT_type        : <0x93>
    <24d>   DW_AT_data_member_location: 0
 <2><24e>: Abbrev Number: 13 (DW_TAG_member)
    <24f>   DW_AT_name        : (indirect string, offset: 0x4a435): SYSCLKSource
    <253>   DW_AT_decl_file   : 7
    <254>   DW_AT_decl_line   : 69
    <255>   DW_AT_decl_column : 12
    <256>   DW_AT_type        : <0x93>
    <25a>   DW_AT_data_member_location: 4
 <2><25b>: Abbrev Number: 13 (DW_TAG_member)
    <25c>   DW_AT_name        : (indirect string, offset: 0x65b4d): AHBCLKDivider
    <260>   DW_AT_decl_file   : 7
    <261>   DW_AT_decl_line   : 72
    <262>   DW_AT_decl_column : 12
    <263>   DW_AT_type        : <0x93>
    <267>   DW_AT_data_member_location: 8
 <2><268>: Abbrev Number: 13 (DW_TAG_member)
    <269>   DW_AT_name        : (indirect string, offset: 0x4b4e): APB1CLKDivider
    <26d>   DW_AT_decl_file   : 7
    <26e>   DW_AT_decl_line   : 75
    <26f>   DW_AT_decl_column : 12
    <270>   DW_AT_type        : <0x93>
    <274>   DW_AT_data_member_location: 12
 <2><275>: Abbrev Number: 13 (DW_TAG_member)
    <276>   DW_AT_name        : (indirect string, offset: 0x38d60): APB2CLKDivider
    <27a>   DW_AT_decl_file   : 7
    <27b>   DW_AT_decl_line   : 78
    <27c>   DW_AT_decl_column : 12
    <27d>   DW_AT_type        : <0x93>
    <281>   DW_AT_data_member_location: 16
 <2><282>: Abbrev Number: 0
 <1><283>: Abbrev Number: 3 (DW_TAG_typedef)
    <284>   DW_AT_name        : (indirect string, offset: 0x25e70): RCC_ClkInitTypeDef
    <288>   DW_AT_decl_file   : 7
    <289>   DW_AT_decl_line   : 80
    <28a>   DW_AT_decl_column : 3
    <28b>   DW_AT_type        : <0x238>
 <1><28f>: Abbrev Number: 12 (DW_TAG_structure_type)
    <290>   DW_AT_byte_size   : 40
    <291>   DW_AT_decl_file   : 8
    <292>   DW_AT_decl_line   : 228
    <293>   DW_AT_decl_column : 9
    <294>   DW_AT_sibling     : <0x302>
 <2><298>: Abbrev Number: 13 (DW_TAG_member)
    <299>   DW_AT_name        : (indirect string, offset: 0x7647): OscillatorType
    <29d>   DW_AT_decl_file   : 8
    <29e>   DW_AT_decl_line   : 230
    <29f>   DW_AT_decl_column : 12
    <2a0>   DW_AT_type        : <0x93>
    <2a4>   DW_AT_data_member_location: 0
 <2><2a5>: Abbrev Number: 13 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x527a6): HSEState
    <2aa>   DW_AT_decl_file   : 8
    <2ab>   DW_AT_decl_line   : 238
    <2ac>   DW_AT_decl_column : 12
    <2ad>   DW_AT_type        : <0x93>
    <2b1>   DW_AT_data_member_location: 4
 <2><2b2>: Abbrev Number: 13 (DW_TAG_member)
    <2b3>   DW_AT_name        : (indirect string, offset: 0x52fa8): HSEPredivValue
    <2b7>   DW_AT_decl_file   : 8
    <2b8>   DW_AT_decl_line   : 241
    <2b9>   DW_AT_decl_column : 12
    <2ba>   DW_AT_type        : <0x93>
    <2be>   DW_AT_data_member_location: 8
 <2><2bf>: Abbrev Number: 13 (DW_TAG_member)
    <2c0>   DW_AT_name        : (indirect string, offset: 0x4d2fd): LSEState
    <2c4>   DW_AT_decl_file   : 8
    <2c5>   DW_AT_decl_line   : 244
    <2c6>   DW_AT_decl_column : 12
    <2c7>   DW_AT_type        : <0x93>
    <2cb>   DW_AT_data_member_location: 12
 <2><2cc>: Abbrev Number: 13 (DW_TAG_member)
    <2cd>   DW_AT_name        : (indirect string, offset: 0x37477): HSIState
    <2d1>   DW_AT_decl_file   : 8
    <2d2>   DW_AT_decl_line   : 247
    <2d3>   DW_AT_decl_column : 12
    <2d4>   DW_AT_type        : <0x93>
    <2d8>   DW_AT_data_member_location: 16
 <2><2d9>: Abbrev Number: 13 (DW_TAG_member)
    <2da>   DW_AT_name        : (indirect string, offset: 0x69a93): HSICalibrationValue
    <2de>   DW_AT_decl_file   : 8
    <2df>   DW_AT_decl_line   : 250
    <2e0>   DW_AT_decl_column : 12
    <2e1>   DW_AT_type        : <0x93>
    <2e5>   DW_AT_data_member_location: 20
 <2><2e6>: Abbrev Number: 13 (DW_TAG_member)
    <2e7>   DW_AT_name        : (indirect string, offset: 0x6d746): LSIState
    <2eb>   DW_AT_decl_file   : 8
    <2ec>   DW_AT_decl_line   : 253
    <2ed>   DW_AT_decl_column : 12
    <2ee>   DW_AT_type        : <0x93>
    <2f2>   DW_AT_data_member_location: 24
 <2><2f3>: Abbrev Number: 7 (DW_TAG_member)
    <2f4>   DW_AT_name        : PLL
    <2f8>   DW_AT_decl_file   : 8
    <2f9>   DW_AT_decl_line   : 256
    <2fb>   DW_AT_decl_column : 22
    <2fc>   DW_AT_type        : <0x22c>
    <300>   DW_AT_data_member_location: 28
 <2><301>: Abbrev Number: 0
 <1><302>: Abbrev Number: 9 (DW_TAG_typedef)
    <303>   DW_AT_name        : (indirect string, offset: 0x41679): RCC_OscInitTypeDef
    <307>   DW_AT_decl_file   : 8
    <308>   DW_AT_decl_line   : 261
    <30a>   DW_AT_decl_column : 3
    <30b>   DW_AT_type        : <0x28f>
 <1><30f>: Abbrev Number: 12 (DW_TAG_structure_type)
    <310>   DW_AT_byte_size   : 16
    <311>   DW_AT_decl_file   : 9
    <312>   DW_AT_decl_line   : 47
    <313>   DW_AT_decl_column : 9
    <314>   DW_AT_sibling     : <0x34d>
 <2><318>: Abbrev Number: 14 (DW_TAG_member)
    <319>   DW_AT_name        : Pin
    <31d>   DW_AT_decl_file   : 9
    <31e>   DW_AT_decl_line   : 49
    <31f>   DW_AT_decl_column : 12
    <320>   DW_AT_type        : <0x93>
    <324>   DW_AT_data_member_location: 0
 <2><325>: Abbrev Number: 13 (DW_TAG_member)
    <326>   DW_AT_name        : (indirect string, offset: 0x5f4bc): Mode
    <32a>   DW_AT_decl_file   : 9
    <32b>   DW_AT_decl_line   : 52
    <32c>   DW_AT_decl_column : 12
    <32d>   DW_AT_type        : <0x93>
    <331>   DW_AT_data_member_location: 4
 <2><332>: Abbrev Number: 13 (DW_TAG_member)
    <333>   DW_AT_name        : (indirect string, offset: 0x3f71d): Pull
    <337>   DW_AT_decl_file   : 9
    <338>   DW_AT_decl_line   : 55
    <339>   DW_AT_decl_column : 12
    <33a>   DW_AT_type        : <0x93>
    <33e>   DW_AT_data_member_location: 8
 <2><33f>: Abbrev Number: 13 (DW_TAG_member)
    <340>   DW_AT_name        : (indirect string, offset: 0x480fa): Speed
    <344>   DW_AT_decl_file   : 9
    <345>   DW_AT_decl_line   : 58
    <346>   DW_AT_decl_column : 12
    <347>   DW_AT_type        : <0x93>
    <34b>   DW_AT_data_member_location: 12
 <2><34c>: Abbrev Number: 0
 <1><34d>: Abbrev Number: 3 (DW_TAG_typedef)
    <34e>   DW_AT_name        : (indirect string, offset: 0x70b90): GPIO_InitTypeDef
    <352>   DW_AT_decl_file   : 9
    <353>   DW_AT_decl_line   : 60
    <354>   DW_AT_decl_column : 3
    <355>   DW_AT_type        : <0x30f>
 <1><359>: Abbrev Number: 10 (DW_TAG_enumeration_type)
    <35a>   DW_AT_encoding    : 7	(unsigned)
    <35b>   DW_AT_byte_size   : 1
    <35c>   DW_AT_type        : <0x30>
    <360>   DW_AT_decl_file   : 9
    <361>   DW_AT_decl_line   : 66
    <362>   DW_AT_decl_column : 1
    <363>   DW_AT_sibling     : <0x374>
 <2><367>: Abbrev Number: 11 (DW_TAG_enumerator)
    <368>   DW_AT_name        : (indirect string, offset: 0x196ed): GPIO_PIN_RESET
    <36c>   DW_AT_const_value : 0
 <2><36d>: Abbrev Number: 11 (DW_TAG_enumerator)
    <36e>   DW_AT_name        : (indirect string, offset: 0x15bbd): GPIO_PIN_SET
    <372>   DW_AT_const_value : 1
 <2><373>: Abbrev Number: 0
 <1><374>: Abbrev Number: 3 (DW_TAG_typedef)
    <375>   DW_AT_name        : (indirect string, offset: 0x77bab): GPIO_PinState
    <379>   DW_AT_decl_file   : 9
    <37a>   DW_AT_decl_line   : 69
    <37b>   DW_AT_decl_column : 3
    <37c>   DW_AT_type        : <0x359>
 <1><380>: Abbrev Number: 15 (DW_TAG_subprogram)
    <381>   DW_AT_external    : 1
    <381>   DW_AT_name        : (indirect string, offset: 0x4b9b7): HAL_GPIO_Init
    <385>   DW_AT_decl_file   : 9
    <386>   DW_AT_decl_line   : 224
    <387>   DW_AT_decl_column : 7
    <388>   DW_AT_prototyped  : 1
    <388>   DW_AT_declaration : 1
    <388>   DW_AT_sibling     : <0x397>
 <2><38c>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <38d>   DW_AT_type        : <0x397>
 <2><391>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <392>   DW_AT_type        : <0x39d>
 <2><396>: Abbrev Number: 0
 <1><397>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <398>   DW_AT_byte_size   : 4
    <399>   DW_AT_type        : <0x111>
 <1><39d>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <39e>   DW_AT_byte_size   : 4
    <39f>   DW_AT_type        : <0x34d>
 <1><3a3>: Abbrev Number: 15 (DW_TAG_subprogram)
    <3a4>   DW_AT_external    : 1
    <3a4>   DW_AT_name        : (indirect string, offset: 0x15f0e): HAL_GPIO_WritePin
    <3a8>   DW_AT_decl_file   : 9
    <3a9>   DW_AT_decl_line   : 235
    <3aa>   DW_AT_decl_column : 6
    <3ab>   DW_AT_prototyped  : 1
    <3ab>   DW_AT_declaration : 1
    <3ab>   DW_AT_sibling     : <0x3bf>
 <2><3af>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <3b0>   DW_AT_type        : <0x397>
 <2><3b4>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <3b5>   DW_AT_type        : <0x87>
 <2><3b9>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <3ba>   DW_AT_type        : <0x374>
 <2><3be>: Abbrev Number: 0
 <1><3bf>: Abbrev Number: 18 (DW_TAG_subprogram)
    <3c0>   DW_AT_external    : 1
    <3c0>   DW_AT_name        : (indirect string, offset: 0x6949c): HAL_RCC_ClockConfig
    <3c4>   DW_AT_decl_file   : 7
    <3c5>   DW_AT_decl_line   : 1158
    <3c7>   DW_AT_decl_column : 19
    <3c8>   DW_AT_prototyped  : 1
    <3c8>   DW_AT_type        : <0x1ef>
    <3cc>   DW_AT_declaration : 1
    <3cc>   DW_AT_sibling     : <0x3db>
 <2><3d0>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <3d1>   DW_AT_type        : <0x3db>
 <2><3d5>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <3d6>   DW_AT_type        : <0x93>
 <2><3da>: Abbrev Number: 0
 <1><3db>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <3dc>   DW_AT_byte_size   : 4
    <3dd>   DW_AT_type        : <0x283>
 <1><3e1>: Abbrev Number: 18 (DW_TAG_subprogram)
    <3e2>   DW_AT_external    : 1
    <3e2>   DW_AT_name        : (indirect string, offset: 0x55230): HAL_RCC_OscConfig
    <3e6>   DW_AT_decl_file   : 7
    <3e7>   DW_AT_decl_line   : 1157
    <3e9>   DW_AT_decl_column : 19
    <3ea>   DW_AT_prototyped  : 1
    <3ea>   DW_AT_type        : <0x1ef>
    <3ee>   DW_AT_declaration : 1
    <3ee>   DW_AT_sibling     : <0x3f8>
 <2><3f2>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <3f3>   DW_AT_type        : <0x3f8>
 <2><3f7>: Abbrev Number: 0
 <1><3f8>: Abbrev Number: 17 (DW_TAG_pointer_type)
    <3f9>   DW_AT_byte_size   : 4
    <3fa>   DW_AT_type        : <0x302>
 <1><3fe>: Abbrev Number: 19 (DW_TAG_subprogram)
    <3ff>   DW_AT_external    : 1
    <3ff>   DW_AT_name        : (indirect string, offset: 0x31481): HAL_Delay
    <403>   DW_AT_decl_file   : 10
    <404>   DW_AT_decl_line   : 297
    <406>   DW_AT_decl_column : 6
    <407>   DW_AT_prototyped  : 1
    <407>   DW_AT_declaration : 1
    <407>   DW_AT_sibling     : <0x411>
 <2><40b>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <40c>   DW_AT_type        : <0x93>
 <2><410>: Abbrev Number: 0
 <1><411>: Abbrev Number: 15 (DW_TAG_subprogram)
    <412>   DW_AT_external    : 1
    <412>   DW_AT_name        : (indirect string, offset: 0x25bb1): HAL_GPIO_TogglePin
    <416>   DW_AT_decl_file   : 9
    <417>   DW_AT_decl_line   : 236
    <418>   DW_AT_decl_column : 6
    <419>   DW_AT_prototyped  : 1
    <419>   DW_AT_declaration : 1
    <419>   DW_AT_sibling     : <0x428>
 <2><41d>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <41e>   DW_AT_type        : <0x397>
 <2><422>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <423>   DW_AT_type        : <0x87>
 <2><427>: Abbrev Number: 0
 <1><428>: Abbrev Number: 20 (DW_TAG_subprogram)
    <429>   DW_AT_external    : 1
    <429>   DW_AT_name        : (indirect string, offset: 0x725ad): HAL_Init
    <42d>   DW_AT_decl_file   : 10
    <42e>   DW_AT_decl_line   : 283
    <430>   DW_AT_decl_column : 19
    <431>   DW_AT_prototyped  : 1
    <431>   DW_AT_type        : <0x1ef>
    <435>   DW_AT_declaration : 1
 <1><435>: Abbrev Number: 21 (DW_TAG_subprogram)
    <436>   DW_AT_external    : 1
    <436>   DW_AT_name        : (indirect string, offset: 0x36d63): Error_Handler
    <43a>   DW_AT_decl_file   : 1
    <43b>   DW_AT_decl_line   : 172
    <43c>   DW_AT_decl_column : 6
    <43d>   DW_AT_prototyped  : 1
    <43d>   DW_AT_low_pc      : 0x8000254
    <441>   DW_AT_high_pc     : 0xa
    <445>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <447>   DW_AT_GNU_all_call_sites: 1
    <447>   DW_AT_sibling     : <0x45c>
 <2><44b>: Abbrev Number: 22 (DW_TAG_inlined_subroutine)
    <44c>   DW_AT_abstract_origin: <0x4e7>
    <450>   DW_AT_low_pc      : 0x8000258
    <454>   DW_AT_high_pc     : 0x4
    <458>   DW_AT_call_file   : 1
    <459>   DW_AT_call_line   : 176
    <45a>   DW_AT_call_column : 3
 <2><45b>: Abbrev Number: 0
 <1><45c>: Abbrev Number: 23 (DW_TAG_subprogram)
    <45d>   DW_AT_name        : (indirect string, offset: 0x32688): MX_GPIO_Init
    <461>   DW_AT_decl_file   : 1
    <462>   DW_AT_decl_line   : 145
    <463>   DW_AT_decl_column : 13
    <464>   DW_AT_prototyped  : 1
    <464>   DW_AT_low_pc      : 0x80001ec
    <468>   DW_AT_high_pc     : 0x68
    <46c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <46e>   DW_AT_GNU_all_tail_call_sites: 1
    <46e>   DW_AT_sibling     : <0x49b>
 <2><472>: Abbrev Number: 24 (DW_TAG_variable)
    <473>   DW_AT_name        : (indirect string, offset: 0xc1de): GPIO_InitStruct
    <477>   DW_AT_decl_file   : 1
    <478>   DW_AT_decl_line   : 147
    <479>   DW_AT_decl_column : 20
    <47a>   DW_AT_type        : <0x34d>
    <47e>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><481>: Abbrev Number: 25 (DW_TAG_lexical_block)
    <482>   DW_AT_low_pc      : 0x8000200
    <486>   DW_AT_high_pc     : 0x18
 <3><48a>: Abbrev Number: 24 (DW_TAG_variable)
    <48b>   DW_AT_name        : (indirect string, offset: 0xd01): tmpreg
    <48f>   DW_AT_decl_file   : 1
    <490>   DW_AT_decl_line   : 150
    <491>   DW_AT_decl_column : 3
    <492>   DW_AT_type        : <0x9f>
    <496>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <3><499>: Abbrev Number: 0
 <2><49a>: Abbrev Number: 0
 <1><49b>: Abbrev Number: 26 (DW_TAG_subprogram)
    <49c>   DW_AT_external    : 1
    <49c>   DW_AT_name        : (indirect string, offset: 0x554c6): SystemClock_Config
    <4a0>   DW_AT_decl_file   : 1
    <4a1>   DW_AT_decl_line   : 108
    <4a2>   DW_AT_decl_column : 6
    <4a3>   DW_AT_prototyped  : 1
    <4a3>   DW_AT_low_pc      : 0x8000174
    <4a7>   DW_AT_high_pc     : 0x76
    <4ab>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <4ad>   DW_AT_GNU_all_tail_call_sites: 1
    <4ad>   DW_AT_sibling     : <0x4d1>
 <2><4b1>: Abbrev Number: 24 (DW_TAG_variable)
    <4b2>   DW_AT_name        : (indirect string, offset: 0x1ac31): RCC_OscInitStruct
    <4b6>   DW_AT_decl_file   : 1
    <4b7>   DW_AT_decl_line   : 110
    <4b8>   DW_AT_decl_column : 22
    <4b9>   DW_AT_type        : <0x302>
    <4bd>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><4c0>: Abbrev Number: 24 (DW_TAG_variable)
    <4c1>   DW_AT_name        : (indirect string, offset: 0x2e7f8): RCC_ClkInitStruct
    <4c5>   DW_AT_decl_file   : 1
    <4c6>   DW_AT_decl_line   : 111
    <4c7>   DW_AT_decl_column : 22
    <4c8>   DW_AT_type        : <0x283>
    <4cc>   DW_AT_location    : 3 byte block: 91 bc 7f 	(DW_OP_fbreg: -68)
 <2><4d0>: Abbrev Number: 0
 <1><4d1>: Abbrev Number: 27 (DW_TAG_subprogram)
    <4d2>   DW_AT_external    : 1
    <4d2>   DW_AT_name        : (indirect string, offset: 0xc621): main
    <4d6>   DW_AT_decl_file   : 1
    <4d7>   DW_AT_decl_line   : 63
    <4d8>   DW_AT_decl_column : 5
    <4d9>   DW_AT_prototyped  : 1
    <4d9>   DW_AT_type        : <0x79>
    <4dd>   DW_AT_low_pc      : 0x800014c
    <4e1>   DW_AT_high_pc     : 0x28
    <4e5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <4e7>   DW_AT_GNU_all_tail_call_sites: 1
 <1><4e7>: Abbrev Number: 28 (DW_TAG_subprogram)
    <4e8>   DW_AT_name        : (indirect string, offset: 0x43d49): __disable_irq
    <4ec>   DW_AT_decl_file   : 2
    <4ed>   DW_AT_decl_line   : 140
    <4ee>   DW_AT_decl_column : 27
    <4ef>   DW_AT_prototyped  : 1
    <4ef>   DW_AT_inline      : 3	(declared as inline and inlined)
 <1><4f0>: Abbrev Number: 0
  Compilation Unit @ offset 0x4f1:
   Length:        0x20c (32-bit)
   Version:       4
   Abbrev Offset: 0x1e0
   Pointer Size:  4
 <0><4fc>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <4fd>   DW_AT_producer    : (indirect string, offset: 0x3e72a): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <501>   DW_AT_language    : 12	(ANSI C99)
    <502>   DW_AT_name        : (indirect string, offset: 0x7a99f): ../Core/Src/stm32f1xx_hal_msp.c
    <506>   DW_AT_comp_dir    : (indirect string, offset: 0x38bca): D:/github/mc/stm32/test2/test2/Debug
    <50a>   DW_AT_ranges      : 0x28
    <50e>   DW_AT_low_pc      : 0x0
    <512>   DW_AT_stmt_list   : 0x6bc
    <516>   DW_AT_GNU_macros  : 0x14d4c
 <1><51a>: Abbrev Number: 2 (DW_TAG_base_type)
    <51b>   DW_AT_byte_size   : 1
    <51c>   DW_AT_encoding    : 6	(signed char)
    <51d>   DW_AT_name        : (indirect string, offset: 0x3da6f): signed char
 <1><521>: Abbrev Number: 2 (DW_TAG_base_type)
    <522>   DW_AT_byte_size   : 1
    <523>   DW_AT_encoding    : 8	(unsigned char)
    <524>   DW_AT_name        : (indirect string, offset: 0x1917f): unsigned char
 <1><528>: Abbrev Number: 2 (DW_TAG_base_type)
    <529>   DW_AT_byte_size   : 2
    <52a>   DW_AT_encoding    : 5	(signed)
    <52b>   DW_AT_name        : (indirect string, offset: 0x5b49f): short int
 <1><52f>: Abbrev Number: 2 (DW_TAG_base_type)
    <530>   DW_AT_byte_size   : 2
    <531>   DW_AT_encoding    : 7	(unsigned)
    <532>   DW_AT_name        : (indirect string, offset: 0x286aa): short unsigned int
 <1><536>: Abbrev Number: 2 (DW_TAG_base_type)
    <537>   DW_AT_byte_size   : 4
    <538>   DW_AT_encoding    : 5	(signed)
    <539>   DW_AT_name        : (indirect string, offset: 0xaa54): long int
 <1><53d>: Abbrev Number: 3 (DW_TAG_typedef)
    <53e>   DW_AT_name        : (indirect string, offset: 0x4e26e): __uint32_t
    <542>   DW_AT_decl_file   : 2
    <543>   DW_AT_decl_line   : 79
    <544>   DW_AT_decl_column : 25
    <545>   DW_AT_type        : <0x549>
 <1><549>: Abbrev Number: 2 (DW_TAG_base_type)
    <54a>   DW_AT_byte_size   : 4
    <54b>   DW_AT_encoding    : 7	(unsigned)
    <54c>   DW_AT_name        : (indirect string, offset: 0x1d0e9): long unsigned int
 <1><550>: Abbrev Number: 2 (DW_TAG_base_type)
    <551>   DW_AT_byte_size   : 8
    <552>   DW_AT_encoding    : 5	(signed)
    <553>   DW_AT_name        : (indirect string, offset: 0x38898): long long int
 <1><557>: Abbrev Number: 2 (DW_TAG_base_type)
    <558>   DW_AT_byte_size   : 8
    <559>   DW_AT_encoding    : 7	(unsigned)
    <55a>   DW_AT_name        : (indirect string, offset: 0x1992d): long long unsigned int
 <1><55e>: Abbrev Number: 4 (DW_TAG_base_type)
    <55f>   DW_AT_byte_size   : 4
    <560>   DW_AT_encoding    : 5	(signed)
    <561>   DW_AT_name        : int
 <1><565>: Abbrev Number: 2 (DW_TAG_base_type)
    <566>   DW_AT_byte_size   : 4
    <567>   DW_AT_encoding    : 7	(unsigned)
    <568>   DW_AT_name        : (indirect string, offset: 0xa417): unsigned int
 <1><56c>: Abbrev Number: 3 (DW_TAG_typedef)
    <56d>   DW_AT_name        : (indirect string, offset: 0x4e270): uint32_t
    <571>   DW_AT_decl_file   : 3
    <572>   DW_AT_decl_line   : 48
    <573>   DW_AT_decl_column : 20
    <574>   DW_AT_type        : <0x53d>
 <1><578>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <579>   DW_AT_type        : <0x56c>
 <1><57d>: Abbrev Number: 6 (DW_TAG_structure_type)
    <57e>   DW_AT_byte_size   : 32
    <57f>   DW_AT_decl_file   : 4
    <580>   DW_AT_decl_line   : 373
    <582>   DW_AT_decl_column : 9
    <583>   DW_AT_sibling     : <0x5ce>
 <2><587>: Abbrev Number: 7 (DW_TAG_member)
    <588>   DW_AT_name        : (indirect string, offset: 0x7a9bf): EVCR
    <58c>   DW_AT_decl_file   : 4
    <58d>   DW_AT_decl_line   : 375
    <58f>   DW_AT_decl_column : 17
    <590>   DW_AT_type        : <0x578>
    <594>   DW_AT_data_member_location: 0
 <2><595>: Abbrev Number: 7 (DW_TAG_member)
    <596>   DW_AT_name        : (indirect string, offset: 0x7a9ce): MAPR
    <59a>   DW_AT_decl_file   : 4
    <59b>   DW_AT_decl_line   : 376
    <59d>   DW_AT_decl_column : 17
    <59e>   DW_AT_type        : <0x578>
    <5a2>   DW_AT_data_member_location: 4
 <2><5a3>: Abbrev Number: 7 (DW_TAG_member)
    <5a4>   DW_AT_name        : (indirect string, offset: 0x7a998): EXTICR
    <5a8>   DW_AT_decl_file   : 4
    <5a9>   DW_AT_decl_line   : 377
    <5ab>   DW_AT_decl_column : 17
    <5ac>   DW_AT_type        : <0x5de>
    <5b0>   DW_AT_data_member_location: 8
 <2><5b1>: Abbrev Number: 7 (DW_TAG_member)
    <5b2>   DW_AT_name        : (indirect string, offset: 0x7a9c4): RESERVED0
    <5b6>   DW_AT_decl_file   : 4
    <5b7>   DW_AT_decl_line   : 378
    <5b9>   DW_AT_decl_column : 12
    <5ba>   DW_AT_type        : <0x56c>
    <5be>   DW_AT_data_member_location: 24
 <2><5bf>: Abbrev Number: 7 (DW_TAG_member)
    <5c0>   DW_AT_name        : (indirect string, offset: 0x7a985): MAPR2
    <5c4>   DW_AT_decl_file   : 4
    <5c5>   DW_AT_decl_line   : 379
    <5c7>   DW_AT_decl_column : 17
    <5c8>   DW_AT_type        : <0x578>
    <5cc>   DW_AT_data_member_location: 28
 <2><5cd>: Abbrev Number: 0
 <1><5ce>: Abbrev Number: 8 (DW_TAG_array_type)
    <5cf>   DW_AT_type        : <0x578>
    <5d3>   DW_AT_sibling     : <0x5de>
 <2><5d7>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <5d8>   DW_AT_type        : <0x565>
    <5dc>   DW_AT_upper_bound : 3
 <2><5dd>: Abbrev Number: 0
 <1><5de>: Abbrev Number: 5 (DW_TAG_volatile_type)
    <5df>   DW_AT_type        : <0x5ce>
 <1><5e3>: Abbrev Number: 10 (DW_TAG_typedef)
    <5e4>   DW_AT_name        : (indirect string, offset: 0x7a98b): AFIO_TypeDef
    <5e8>   DW_AT_decl_file   : 4
    <5e9>   DW_AT_decl_line   : 380
    <5eb>   DW_AT_decl_column : 3
    <5ec>   DW_AT_type        : <0x57d>
 <1><5f0>: Abbrev Number: 6 (DW_TAG_structure_type)
    <5f1>   DW_AT_byte_size   : 40
    <5f2>   DW_AT_decl_file   : 4
    <5f3>   DW_AT_decl_line   : 424
    <5f5>   DW_AT_decl_column : 9
    <5f6>   DW_AT_sibling     : <0x686>
 <2><5fa>: Abbrev Number: 11 (DW_TAG_member)
    <5fb>   DW_AT_name        : CR
    <5fe>   DW_AT_decl_file   : 4
    <5ff>   DW_AT_decl_line   : 426
    <601>   DW_AT_decl_column : 17
    <602>   DW_AT_type        : <0x578>
    <606>   DW_AT_data_member_location: 0
 <2><607>: Abbrev Number: 7 (DW_TAG_member)
    <608>   DW_AT_name        : (indirect string, offset: 0x4aa9e): CFGR
    <60c>   DW_AT_decl_file   : 4
    <60d>   DW_AT_decl_line   : 427
    <60f>   DW_AT_decl_column : 17
    <610>   DW_AT_type        : <0x578>
    <614>   DW_AT_data_member_location: 4
 <2><615>: Abbrev Number: 11 (DW_TAG_member)
    <616>   DW_AT_name        : CIR
    <61a>   DW_AT_decl_file   : 4
    <61b>   DW_AT_decl_line   : 428
    <61d>   DW_AT_decl_column : 17
    <61e>   DW_AT_type        : <0x578>
    <622>   DW_AT_data_member_location: 8
 <2><623>: Abbrev Number: 7 (DW_TAG_member)
    <624>   DW_AT_name        : (indirect string, offset: 0x35c15): APB2RSTR
    <628>   DW_AT_decl_file   : 4
    <629>   DW_AT_decl_line   : 429
    <62b>   DW_AT_decl_column : 17
    <62c>   DW_AT_type        : <0x578>
    <630>   DW_AT_data_member_location: 12
 <2><631>: Abbrev Number: 7 (DW_TAG_member)
    <632>   DW_AT_name        : (indirect string, offset: 0xe01d): APB1RSTR
    <636>   DW_AT_decl_file   : 4
    <637>   DW_AT_decl_line   : 430
    <639>   DW_AT_decl_column : 17
    <63a>   DW_AT_type        : <0x578>
    <63e>   DW_AT_data_member_location: 16
 <2><63f>: Abbrev Number: 7 (DW_TAG_member)
    <640>   DW_AT_name        : (indirect string, offset: 0xb7d8): AHBENR
    <644>   DW_AT_decl_file   : 4
    <645>   DW_AT_decl_line   : 431
    <647>   DW_AT_decl_column : 17
    <648>   DW_AT_type        : <0x578>
    <64c>   DW_AT_data_member_location: 20
 <2><64d>: Abbrev Number: 7 (DW_TAG_member)
    <64e>   DW_AT_name        : (indirect string, offset: 0xe9b5): APB2ENR
    <652>   DW_AT_decl_file   : 4
    <653>   DW_AT_decl_line   : 432
    <655>   DW_AT_decl_column : 17
    <656>   DW_AT_type        : <0x578>
    <65a>   DW_AT_data_member_location: 24
 <2><65b>: Abbrev Number: 7 (DW_TAG_member)
    <65c>   DW_AT_name        : (indirect string, offset: 0x5c337): APB1ENR
    <660>   DW_AT_decl_file   : 4
    <661>   DW_AT_decl_line   : 433
    <663>   DW_AT_decl_column : 17
    <664>   DW_AT_type        : <0x578>
    <668>   DW_AT_data_member_location: 28
 <2><669>: Abbrev Number: 7 (DW_TAG_member)
    <66a>   DW_AT_name        : (indirect string, offset: 0x11037): BDCR
    <66e>   DW_AT_decl_file   : 4
    <66f>   DW_AT_decl_line   : 434
    <671>   DW_AT_decl_column : 17
    <672>   DW_AT_type        : <0x578>
    <676>   DW_AT_data_member_location: 32
 <2><677>: Abbrev Number: 11 (DW_TAG_member)
    <678>   DW_AT_name        : CSR
    <67c>   DW_AT_decl_file   : 4
    <67d>   DW_AT_decl_line   : 435
    <67f>   DW_AT_decl_column : 17
    <680>   DW_AT_type        : <0x578>
    <684>   DW_AT_data_member_location: 36
 <2><685>: Abbrev Number: 0
 <1><686>: Abbrev Number: 10 (DW_TAG_typedef)
    <687>   DW_AT_name        : (indirect string, offset: 0x39663): RCC_TypeDef
    <68b>   DW_AT_decl_file   : 4
    <68c>   DW_AT_decl_line   : 438
    <68e>   DW_AT_decl_column : 3
    <68f>   DW_AT_type        : <0x5f0>
 <1><693>: Abbrev Number: 2 (DW_TAG_base_type)
    <694>   DW_AT_byte_size   : 8
    <695>   DW_AT_encoding    : 4	(float)
    <696>   DW_AT_name        : (indirect string, offset: 0x13834): long double
 <1><69a>: Abbrev Number: 12 (DW_TAG_subprogram)
    <69b>   DW_AT_external    : 1
    <69b>   DW_AT_name        : (indirect string, offset: 0x7a9d3): HAL_MspInit
    <69f>   DW_AT_decl_file   : 1
    <6a0>   DW_AT_decl_line   : 63
    <6a1>   DW_AT_decl_column : 6
    <6a2>   DW_AT_prototyped  : 1
    <6a2>   DW_AT_low_pc      : 0x8000260
    <6a6>   DW_AT_high_pc     : 0x64
    <6aa>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6ac>   DW_AT_GNU_all_call_sites: 1
 <2><6ac>: Abbrev Number: 13 (DW_TAG_lexical_block)
    <6ad>   DW_AT_low_pc      : 0x8000266
    <6b1>   DW_AT_high_pc     : 0x18
    <6b5>   DW_AT_sibling     : <0x6c9>
 <3><6b9>: Abbrev Number: 14 (DW_TAG_variable)
    <6ba>   DW_AT_name        : (indirect string, offset: 0xd01): tmpreg
    <6be>   DW_AT_decl_file   : 1
    <6bf>   DW_AT_decl_line   : 69
    <6c0>   DW_AT_decl_column : 3
    <6c1>   DW_AT_type        : <0x578>
    <6c5>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <3><6c8>: Abbrev Number: 0
 <2><6c9>: Abbrev Number: 13 (DW_TAG_lexical_block)
    <6ca>   DW_AT_low_pc      : 0x800027e
    <6ce>   DW_AT_high_pc     : 0x18
    <6d2>   DW_AT_sibling     : <0x6e6>
 <3><6d6>: Abbrev Number: 14 (DW_TAG_variable)
    <6d7>   DW_AT_name        : (indirect string, offset: 0xd01): tmpreg
    <6db>   DW_AT_decl_file   : 1
    <6dc>   DW_AT_decl_line   : 70
    <6dd>   DW_AT_decl_column : 3
    <6de>   DW_AT_type        : <0x578>
    <6e2>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <3><6e5>: Abbrev Number: 0
 <2><6e6>: Abbrev Number: 15 (DW_TAG_lexical_block)
    <6e7>   DW_AT_low_pc      : 0x8000296
    <6eb>   DW_AT_high_pc     : 0x1c
 <3><6ef>: Abbrev Number: 14 (DW_TAG_variable)
    <6f0>   DW_AT_name        : (indirect string, offset: 0xd01): tmpreg
    <6f4>   DW_AT_decl_file   : 1
    <6f5>   DW_AT_decl_line   : 76
    <6f6>   DW_AT_decl_column : 3
    <6f7>   DW_AT_type        : <0x56c>
    <6fb>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><6fe>: Abbrev Number: 0
 <2><6ff>: Abbrev Number: 0
 <1><700>: Abbrev Number: 0
  Compilation Unit @ offset 0x701:
   Length:        0x11e (32-bit)
   Version:       4
   Abbrev Offset: 0x2b4
   Pointer Size:  4
 <0><70c>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <70d>   DW_AT_producer    : (indirect string, offset: 0x3e72a): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <711>   DW_AT_language    : 12	(ANSI C99)
    <712>   DW_AT_name        : (indirect string, offset: 0x7aa8d): ../Core/Src/stm32f1xx_it.c
    <716>   DW_AT_comp_dir    : (indirect string, offset: 0x38bca): D:/github/mc/stm32/test2/test2/Debug
    <71a>   DW_AT_ranges      : 0x38
    <71e>   DW_AT_low_pc      : 0x0
    <722>   DW_AT_stmt_list   : 0xce1
    <726>   DW_AT_GNU_macros  : 0x14eda
 <1><72a>: Abbrev Number: 2 (DW_TAG_base_type)
    <72b>   DW_AT_byte_size   : 1
    <72c>   DW_AT_encoding    : 6	(signed char)
    <72d>   DW_AT_name        : (indirect string, offset: 0x3da6f): signed char
 <1><731>: Abbrev Number: 2 (DW_TAG_base_type)
    <732>   DW_AT_byte_size   : 1
    <733>   DW_AT_encoding    : 8	(unsigned char)
    <734>   DW_AT_name        : (indirect string, offset: 0x1917f): unsigned char
 <1><738>: Abbrev Number: 2 (DW_TAG_base_type)
    <739>   DW_AT_byte_size   : 2
    <73a>   DW_AT_encoding    : 5	(signed)
    <73b>   DW_AT_name        : (indirect string, offset: 0x5b49f): short int
 <1><73f>: Abbrev Number: 2 (DW_TAG_base_type)
    <740>   DW_AT_byte_size   : 2
    <741>   DW_AT_encoding    : 7	(unsigned)
    <742>   DW_AT_name        : (indirect string, offset: 0x286aa): short unsigned int
 <1><746>: Abbrev Number: 2 (DW_TAG_base_type)
    <747>   DW_AT_byte_size   : 4
    <748>   DW_AT_encoding    : 5	(signed)
    <749>   DW_AT_name        : (indirect string, offset: 0xaa54): long int
 <1><74d>: Abbrev Number: 2 (DW_TAG_base_type)
    <74e>   DW_AT_byte_size   : 4
    <74f>   DW_AT_encoding    : 7	(unsigned)
    <750>   DW_AT_name        : (indirect string, offset: 0x1d0e9): long unsigned int
 <1><754>: Abbrev Number: 2 (DW_TAG_base_type)
    <755>   DW_AT_byte_size   : 8
    <756>   DW_AT_encoding    : 5	(signed)
    <757>   DW_AT_name        : (indirect string, offset: 0x38898): long long int
 <1><75b>: Abbrev Number: 2 (DW_TAG_base_type)
    <75c>   DW_AT_byte_size   : 8
    <75d>   DW_AT_encoding    : 7	(unsigned)
    <75e>   DW_AT_name        : (indirect string, offset: 0x1992d): long long unsigned int
 <1><762>: Abbrev Number: 3 (DW_TAG_base_type)
    <763>   DW_AT_byte_size   : 4
    <764>   DW_AT_encoding    : 5	(signed)
    <765>   DW_AT_name        : int
 <1><769>: Abbrev Number: 2 (DW_TAG_base_type)
    <76a>   DW_AT_byte_size   : 4
    <76b>   DW_AT_encoding    : 7	(unsigned)
    <76c>   DW_AT_name        : (indirect string, offset: 0xa417): unsigned int
 <1><770>: Abbrev Number: 2 (DW_TAG_base_type)
    <771>   DW_AT_byte_size   : 8
    <772>   DW_AT_encoding    : 4	(float)
    <773>   DW_AT_name        : (indirect string, offset: 0x13834): long double
 <1><777>: Abbrev Number: 4 (DW_TAG_subprogram)
    <778>   DW_AT_external    : 1
    <778>   DW_AT_name        : (indirect string, offset: 0x7aa4d): HAL_IncTick
    <77c>   DW_AT_decl_file   : 2
    <77d>   DW_AT_decl_line   : 296
    <77f>   DW_AT_decl_column : 6
    <780>   DW_AT_prototyped  : 1
    <780>   DW_AT_declaration : 1
 <1><780>: Abbrev Number: 5 (DW_TAG_subprogram)
    <781>   DW_AT_external    : 1
    <781>   DW_AT_name        : (indirect string, offset: 0x7aa7d): SysTick_Handler
    <785>   DW_AT_decl_file   : 1
    <786>   DW_AT_decl_line   : 183
    <787>   DW_AT_decl_column : 6
    <788>   DW_AT_prototyped  : 1
    <788>   DW_AT_low_pc      : 0x8000306
    <78c>   DW_AT_high_pc     : 0xc
    <790>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <792>   DW_AT_GNU_all_tail_call_sites: 1
 <1><792>: Abbrev Number: 6 (DW_TAG_subprogram)
    <793>   DW_AT_external    : 1
    <793>   DW_AT_name        : (indirect string, offset: 0x7aa2c): PendSV_Handler
    <797>   DW_AT_decl_file   : 1
    <798>   DW_AT_decl_line   : 170
    <799>   DW_AT_decl_column : 6
    <79a>   DW_AT_prototyped  : 1
    <79a>   DW_AT_low_pc      : 0x80002fa
    <79e>   DW_AT_high_pc     : 0xc
    <7a2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7a4>   DW_AT_GNU_all_call_sites: 1
 <1><7a4>: Abbrev Number: 6 (DW_TAG_subprogram)
    <7a5>   DW_AT_external    : 1
    <7a5>   DW_AT_name        : (indirect string, offset: 0x7aa1b): DebugMon_Handler
    <7a9>   DW_AT_decl_file   : 1
    <7aa>   DW_AT_decl_line   : 157
    <7ab>   DW_AT_decl_column : 6
    <7ac>   DW_AT_prototyped  : 1
    <7ac>   DW_AT_low_pc      : 0x80002ee
    <7b0>   DW_AT_high_pc     : 0xc
    <7b4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7b6>   DW_AT_GNU_all_call_sites: 1
 <1><7b6>: Abbrev Number: 6 (DW_TAG_subprogram)
    <7b7>   DW_AT_external    : 1
    <7b7>   DW_AT_name        : (indirect string, offset: 0x7aa0f): SVC_Handler
    <7bb>   DW_AT_decl_file   : 1
    <7bc>   DW_AT_decl_line   : 144
    <7bd>   DW_AT_decl_column : 6
    <7be>   DW_AT_prototyped  : 1
    <7be>   DW_AT_low_pc      : 0x80002e2
    <7c2>   DW_AT_high_pc     : 0xc
    <7c6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7c8>   DW_AT_GNU_all_call_sites: 1
 <1><7c8>: Abbrev Number: 6 (DW_TAG_subprogram)
    <7c9>   DW_AT_external    : 1
    <7c9>   DW_AT_name        : (indirect string, offset: 0x7aa6a): UsageFault_Handler
    <7cd>   DW_AT_decl_file   : 1
    <7ce>   DW_AT_decl_line   : 129
    <7cf>   DW_AT_decl_column : 6
    <7d0>   DW_AT_prototyped  : 1
    <7d0>   DW_AT_low_pc      : 0x80002dc
    <7d4>   DW_AT_high_pc     : 0x6
    <7d8>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7da>   DW_AT_GNU_all_call_sites: 1
 <1><7da>: Abbrev Number: 6 (DW_TAG_subprogram)
    <7db>   DW_AT_external    : 1
    <7db>   DW_AT_name        : (indirect string, offset: 0x7aa59): BusFault_Handler
    <7df>   DW_AT_decl_file   : 1
    <7e0>   DW_AT_decl_line   : 114
    <7e1>   DW_AT_decl_column : 6
    <7e2>   DW_AT_prototyped  : 1
    <7e2>   DW_AT_low_pc      : 0x80002d6
    <7e6>   DW_AT_high_pc     : 0x6
    <7ea>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7ec>   DW_AT_GNU_all_call_sites: 1
 <1><7ec>: Abbrev Number: 6 (DW_TAG_subprogram)
    <7ed>   DW_AT_external    : 1
    <7ed>   DW_AT_name        : (indirect string, offset: 0x7aa3b): MemManage_Handler
    <7f1>   DW_AT_decl_file   : 1
    <7f2>   DW_AT_decl_line   : 99
    <7f3>   DW_AT_decl_column : 6
    <7f4>   DW_AT_prototyped  : 1
    <7f4>   DW_AT_low_pc      : 0x80002d0
    <7f8>   DW_AT_high_pc     : 0x6
    <7fc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7fe>   DW_AT_GNU_all_call_sites: 1
 <1><7fe>: Abbrev Number: 6 (DW_TAG_subprogram)
    <7ff>   DW_AT_external    : 1
    <7ff>   DW_AT_name        : (indirect string, offset: 0x7a9f1): HardFault_Handler
    <803>   DW_AT_decl_file   : 1
    <804>   DW_AT_decl_line   : 84
    <805>   DW_AT_decl_column : 6
    <806>   DW_AT_prototyped  : 1
    <806>   DW_AT_low_pc      : 0x80002ca
    <80a>   DW_AT_high_pc     : 0x6
    <80e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <810>   DW_AT_GNU_all_call_sites: 1
 <1><810>: Abbrev Number: 6 (DW_TAG_subprogram)
    <811>   DW_AT_external    : 1
    <811>   DW_AT_name        : (indirect string, offset: 0x7aa03): NMI_Handler
    <815>   DW_AT_decl_file   : 1
    <816>   DW_AT_decl_line   : 69
    <817>   DW_AT_decl_column : 6
    <818>   DW_AT_prototyped  : 1
    <818>   DW_AT_low_pc      : 0x80002c4
    <81c>   DW_AT_high_pc     : 0x6
    <820>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <822>   DW_AT_GNU_all_call_sites: 1
 <1><822>: Abbrev Number: 0
  Compilation Unit @ offset 0x823:
   Length:        0x239 (32-bit)
   Version:       4
   Abbrev Offset: 0x328
   Pointer Size:  4
 <0><82e>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <82f>   DW_AT_producer    : (indirect string, offset: 0x3e72a): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <833>   DW_AT_language    : 12	(ANSI C99)
    <834>   DW_AT_name        : (indirect string, offset: 0x7aad5): ../Core/Src/system_stm32f1xx.c
    <838>   DW_AT_comp_dir    : (indirect string, offset: 0x38bca): D:/github/mc/stm32/test2/test2/Debug
    <83c>   DW_AT_ranges      : 0x88
    <840>   DW_AT_low_pc      : 0x0
    <844>   DW_AT_stmt_list   : 0x13c8
    <848>   DW_AT_GNU_macros  : 0x15072
 <1><84c>: Abbrev Number: 2 (DW_TAG_base_type)
    <84d>   DW_AT_byte_size   : 1
    <84e>   DW_AT_encoding    : 6	(signed char)
    <84f>   DW_AT_name        : (indirect string, offset: 0x3da6f): signed char
 <1><853>: Abbrev Number: 3 (DW_TAG_typedef)
    <854>   DW_AT_name        : (indirect string, offset: 0x7aaa8): __uint8_t
    <858>   DW_AT_decl_file   : 2
    <859>   DW_AT_decl_line   : 43
    <85a>   DW_AT_decl_column : 24
    <85b>   DW_AT_type        : <0x85f>
 <1><85f>: Abbrev Number: 2 (DW_TAG_base_type)
    <860>   DW_AT_byte_size   : 1
    <861>   DW_AT_encoding    : 8	(unsigned char)
    <862>   DW_AT_name        : (indirect string, offset: 0x1917f): unsigned char
 <1><866>: Abbrev Number: 2 (DW_TAG_base_type)
    <867>   DW_AT_byte_size   : 2
    <868>   DW_AT_encoding    : 5	(signed)
    <869>   DW_AT_name        : (indirect string, offset: 0x5b49f): short int
 <1><86d>: Abbrev Number: 2 (DW_TAG_base_type)
    <86e>   DW_AT_byte_size   : 2
    <86f>   DW_AT_encoding    : 7	(unsigned)
    <870>   DW_AT_name        : (indirect string, offset: 0x286aa): short unsigned int
 <1><874>: Abbrev Number: 2 (DW_TAG_base_type)
    <875>   DW_AT_byte_size   : 4
    <876>   DW_AT_encoding    : 5	(signed)
    <877>   DW_AT_name        : (indirect string, offset: 0xaa54): long int
 <1><87b>: Abbrev Number: 3 (DW_TAG_typedef)
    <87c>   DW_AT_name        : (indirect string, offset: 0x4e26e): __uint32_t
    <880>   DW_AT_decl_file   : 2
    <881>   DW_AT_decl_line   : 79
    <882>   DW_AT_decl_column : 25
    <883>   DW_AT_type        : <0x887>
 <1><887>: Abbrev Number: 2 (DW_TAG_base_type)
    <888>   DW_AT_byte_size   : 4
    <889>   DW_AT_encoding    : 7	(unsigned)
    <88a>   DW_AT_name        : (indirect string, offset: 0x1d0e9): long unsigned int
 <1><88e>: Abbrev Number: 2 (DW_TAG_base_type)
    <88f>   DW_AT_byte_size   : 8
    <890>   DW_AT_encoding    : 5	(signed)
    <891>   DW_AT_name        : (indirect string, offset: 0x38898): long long int
 <1><895>: Abbrev Number: 2 (DW_TAG_base_type)
    <896>   DW_AT_byte_size   : 8
    <897>   DW_AT_encoding    : 7	(unsigned)
    <898>   DW_AT_name        : (indirect string, offset: 0x1992d): long long unsigned int
 <1><89c>: Abbrev Number: 4 (DW_TAG_base_type)
    <89d>   DW_AT_byte_size   : 4
    <89e>   DW_AT_encoding    : 5	(signed)
    <89f>   DW_AT_name        : int
 <1><8a3>: Abbrev Number: 2 (DW_TAG_base_type)
    <8a4>   DW_AT_byte_size   : 4
    <8a5>   DW_AT_encoding    : 7	(unsigned)
    <8a6>   DW_AT_name        : (indirect string, offset: 0xa417): unsigned int
 <1><8aa>: Abbrev Number: 3 (DW_TAG_typedef)
    <8ab>   DW_AT_name        : (indirect string, offset: 0x7aaaa): uint8_t
    <8af>   DW_AT_decl_file   : 3
    <8b0>   DW_AT_decl_line   : 24
    <8b1>   DW_AT_decl_column : 19
    <8b2>   DW_AT_type        : <0x853>
 <1><8b6>: Abbrev Number: 5 (DW_TAG_const_type)
    <8b7>   DW_AT_type        : <0x8aa>
 <1><8bb>: Abbrev Number: 3 (DW_TAG_typedef)
    <8bc>   DW_AT_name        : (indirect string, offset: 0x4e270): uint32_t
    <8c0>   DW_AT_decl_file   : 3
    <8c1>   DW_AT_decl_line   : 48
    <8c2>   DW_AT_decl_column : 20
    <8c3>   DW_AT_type        : <0x87b>
 <1><8c7>: Abbrev Number: 6 (DW_TAG_volatile_type)
    <8c8>   DW_AT_type        : <0x8bb>
 <1><8cc>: Abbrev Number: 7 (DW_TAG_variable)
    <8cd>   DW_AT_name        : (indirect string, offset: 0x7ab12): SystemCoreClock
    <8d1>   DW_AT_decl_file   : 4
    <8d2>   DW_AT_decl_line   : 51
    <8d3>   DW_AT_decl_column : 17
    <8d4>   DW_AT_type        : <0x8bb>
    <8d8>   DW_AT_external    : 1
    <8d8>   DW_AT_declaration : 1
 <1><8d8>: Abbrev Number: 8 (DW_TAG_array_type)
    <8d9>   DW_AT_type        : <0x8b6>
    <8dd>   DW_AT_sibling     : <0x8e8>
 <2><8e1>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <8e2>   DW_AT_type        : <0x8a3>
    <8e6>   DW_AT_upper_bound : 15
 <2><8e7>: Abbrev Number: 0
 <1><8e8>: Abbrev Number: 5 (DW_TAG_const_type)
    <8e9>   DW_AT_type        : <0x8d8>
 <1><8ed>: Abbrev Number: 7 (DW_TAG_variable)
    <8ee>   DW_AT_name        : (indirect string, offset: 0x7aac7): AHBPrescTable
    <8f2>   DW_AT_decl_file   : 4
    <8f3>   DW_AT_decl_line   : 52
    <8f4>   DW_AT_decl_column : 23
    <8f5>   DW_AT_type        : <0x8e8>
    <8f9>   DW_AT_external    : 1
    <8f9>   DW_AT_declaration : 1
 <1><8f9>: Abbrev Number: 8 (DW_TAG_array_type)
    <8fa>   DW_AT_type        : <0x8b6>
    <8fe>   DW_AT_sibling     : <0x909>
 <2><902>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <903>   DW_AT_type        : <0x8a3>
    <907>   DW_AT_upper_bound : 7
 <2><908>: Abbrev Number: 0
 <1><909>: Abbrev Number: 5 (DW_TAG_const_type)
    <90a>   DW_AT_type        : <0x8f9>
 <1><90e>: Abbrev Number: 7 (DW_TAG_variable)
    <90f>   DW_AT_name        : (indirect string, offset: 0x7ab22): APBPrescTable
    <913>   DW_AT_decl_file   : 4
    <914>   DW_AT_decl_line   : 53
    <915>   DW_AT_decl_column : 23
    <916>   DW_AT_type        : <0x909>
    <91a>   DW_AT_external    : 1
    <91a>   DW_AT_declaration : 1
 <1><91a>: Abbrev Number: 10 (DW_TAG_structure_type)
    <91b>   DW_AT_byte_size   : 40
    <91c>   DW_AT_decl_file   : 5
    <91d>   DW_AT_decl_line   : 424
    <91f>   DW_AT_decl_column : 9
    <920>   DW_AT_sibling     : <0x9b0>
 <2><924>: Abbrev Number: 11 (DW_TAG_member)
    <925>   DW_AT_name        : CR
    <928>   DW_AT_decl_file   : 5
    <929>   DW_AT_decl_line   : 426
    <92b>   DW_AT_decl_column : 17
    <92c>   DW_AT_type        : <0x8c7>
    <930>   DW_AT_data_member_location: 0
 <2><931>: Abbrev Number: 12 (DW_TAG_member)
    <932>   DW_AT_name        : (indirect string, offset: 0x4aa9e): CFGR
    <936>   DW_AT_decl_file   : 5
    <937>   DW_AT_decl_line   : 427
    <939>   DW_AT_decl_column : 17
    <93a>   DW_AT_type        : <0x8c7>
    <93e>   DW_AT_data_member_location: 4
 <2><93f>: Abbrev Number: 11 (DW_TAG_member)
    <940>   DW_AT_name        : CIR
    <944>   DW_AT_decl_file   : 5
    <945>   DW_AT_decl_line   : 428
    <947>   DW_AT_decl_column : 17
    <948>   DW_AT_type        : <0x8c7>
    <94c>   DW_AT_data_member_location: 8
 <2><94d>: Abbrev Number: 12 (DW_TAG_member)
    <94e>   DW_AT_name        : (indirect string, offset: 0x35c15): APB2RSTR
    <952>   DW_AT_decl_file   : 5
    <953>   DW_AT_decl_line   : 429
    <955>   DW_AT_decl_column : 17
    <956>   DW_AT_type        : <0x8c7>
    <95a>   DW_AT_data_member_location: 12
 <2><95b>: Abbrev Number: 12 (DW_TAG_member)
    <95c>   DW_AT_name        : (indirect string, offset: 0xe01d): APB1RSTR
    <960>   DW_AT_decl_file   : 5
    <961>   DW_AT_decl_line   : 430
    <963>   DW_AT_decl_column : 17
    <964>   DW_AT_type        : <0x8c7>
    <968>   DW_AT_data_member_location: 16
 <2><969>: Abbrev Number: 12 (DW_TAG_member)
    <96a>   DW_AT_name        : (indirect string, offset: 0xb7d8): AHBENR
    <96e>   DW_AT_decl_file   : 5
    <96f>   DW_AT_decl_line   : 431
    <971>   DW_AT_decl_column : 17
    <972>   DW_AT_type        : <0x8c7>
    <976>   DW_AT_data_member_location: 20
 <2><977>: Abbrev Number: 12 (DW_TAG_member)
    <978>   DW_AT_name        : (indirect string, offset: 0xe9b5): APB2ENR
    <97c>   DW_AT_decl_file   : 5
    <97d>   DW_AT_decl_line   : 432
    <97f>   DW_AT_decl_column : 17
    <980>   DW_AT_type        : <0x8c7>
    <984>   DW_AT_data_member_location: 24
 <2><985>: Abbrev Number: 12 (DW_TAG_member)
    <986>   DW_AT_name        : (indirect string, offset: 0x5c337): APB1ENR
    <98a>   DW_AT_decl_file   : 5
    <98b>   DW_AT_decl_line   : 433
    <98d>   DW_AT_decl_column : 17
    <98e>   DW_AT_type        : <0x8c7>
    <992>   DW_AT_data_member_location: 28
 <2><993>: Abbrev Number: 12 (DW_TAG_member)
    <994>   DW_AT_name        : (indirect string, offset: 0x11037): BDCR
    <998>   DW_AT_decl_file   : 5
    <999>   DW_AT_decl_line   : 434
    <99b>   DW_AT_decl_column : 17
    <99c>   DW_AT_type        : <0x8c7>
    <9a0>   DW_AT_data_member_location: 32
 <2><9a1>: Abbrev Number: 11 (DW_TAG_member)
    <9a2>   DW_AT_name        : CSR
    <9a6>   DW_AT_decl_file   : 5
    <9a7>   DW_AT_decl_line   : 435
    <9a9>   DW_AT_decl_column : 17
    <9aa>   DW_AT_type        : <0x8c7>
    <9ae>   DW_AT_data_member_location: 36
 <2><9af>: Abbrev Number: 0
 <1><9b0>: Abbrev Number: 13 (DW_TAG_typedef)
    <9b1>   DW_AT_name        : (indirect string, offset: 0x39663): RCC_TypeDef
    <9b5>   DW_AT_decl_file   : 5
    <9b6>   DW_AT_decl_line   : 438
    <9b8>   DW_AT_decl_column : 3
    <9b9>   DW_AT_type        : <0x91a>
 <1><9bd>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <9be>   DW_AT_encoding    : 7	(unsigned)
    <9bf>   DW_AT_byte_size   : 1
    <9c0>   DW_AT_type        : <0x85f>
    <9c4>   DW_AT_decl_file   : 6
    <9c5>   DW_AT_decl_line   : 152
    <9c6>   DW_AT_decl_column : 1
    <9c7>   DW_AT_sibling     : <0x9d8>
 <2><9cb>: Abbrev Number: 15 (DW_TAG_enumerator)
    <9cc>   DW_AT_name        : (indirect string, offset: 0x6cb20): RESET
    <9d0>   DW_AT_const_value : 0
 <2><9d1>: Abbrev Number: 16 (DW_TAG_enumerator)
    <9d2>   DW_AT_name        : SET
    <9d6>   DW_AT_const_value : 1
 <2><9d7>: Abbrev Number: 0
 <1><9d8>: Abbrev Number: 2 (DW_TAG_base_type)
    <9d9>   DW_AT_byte_size   : 8
    <9da>   DW_AT_encoding    : 4	(float)
    <9db>   DW_AT_name        : (indirect string, offset: 0x13834): long double
 <1><9df>: Abbrev Number: 17 (DW_TAG_variable)
    <9e0>   DW_AT_specification: <0x8cc>
    <9e4>   DW_AT_decl_file   : 1
    <9e5>   DW_AT_decl_line   : 142
    <9e6>   DW_AT_decl_column : 10
    <9e7>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><9ed>: Abbrev Number: 17 (DW_TAG_variable)
    <9ee>   DW_AT_specification: <0x8ed>
    <9f2>   DW_AT_decl_file   : 1
    <9f3>   DW_AT_decl_line   : 143
    <9f4>   DW_AT_decl_column : 15
    <9f5>   DW_AT_location    : 5 byte block: 3 fc 11 0 8 	(DW_OP_addr: 80011fc)
 <1><9fb>: Abbrev Number: 17 (DW_TAG_variable)
    <9fc>   DW_AT_specification: <0x90e>
    <a00>   DW_AT_decl_file   : 1
    <a01>   DW_AT_decl_line   : 144
    <a02>   DW_AT_decl_column : 15
    <a03>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><a09>: Abbrev Number: 18 (DW_TAG_subprogram)
    <a0a>   DW_AT_external    : 1
    <a0a>   DW_AT_name        : (indirect string, offset: 0x7aafc): SystemCoreClockUpdate
    <a0e>   DW_AT_decl_file   : 1
    <a0f>   DW_AT_decl_line   : 225
    <a10>   DW_AT_decl_column : 6
    <a11>   DW_AT_prototyped  : 1
    <a11>   DW_AT_low_pc      : 0x0
    <a15>   DW_AT_high_pc     : 0xe4
    <a19>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a1b>   DW_AT_GNU_all_call_sites: 1
    <a1b>   DW_AT_sibling     : <0xa4d>
 <2><a1f>: Abbrev Number: 19 (DW_TAG_variable)
    <a20>   DW_AT_name        : tmp
    <a24>   DW_AT_decl_file   : 1
    <a25>   DW_AT_decl_line   : 227
    <a26>   DW_AT_decl_column : 12
    <a27>   DW_AT_type        : <0x8bb>
    <a2b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a2e>: Abbrev Number: 20 (DW_TAG_variable)
    <a2f>   DW_AT_name        : (indirect string, offset: 0x7aaf4): pllmull
    <a33>   DW_AT_decl_file   : 1
    <a34>   DW_AT_decl_line   : 227
    <a35>   DW_AT_decl_column : 22
    <a36>   DW_AT_type        : <0x8bb>
    <a3a>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><a3d>: Abbrev Number: 20 (DW_TAG_variable)
    <a3e>   DW_AT_name        : (indirect string, offset: 0x7aab2): pllsource
    <a42>   DW_AT_decl_file   : 1
    <a43>   DW_AT_decl_line   : 227
    <a44>   DW_AT_decl_column : 36
    <a45>   DW_AT_type        : <0x8bb>
    <a49>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><a4c>: Abbrev Number: 0
 <1><a4d>: Abbrev Number: 21 (DW_TAG_subprogram)
    <a4e>   DW_AT_external    : 1
    <a4e>   DW_AT_name        : (indirect string, offset: 0x7aabc): SystemInit
    <a52>   DW_AT_decl_file   : 1
    <a53>   DW_AT_decl_line   : 176
    <a54>   DW_AT_decl_column : 6
    <a55>   DW_AT_prototyped  : 1
    <a55>   DW_AT_low_pc      : 0x8000312
    <a59>   DW_AT_high_pc     : 0xc
    <a5d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a5f>   DW_AT_GNU_all_call_sites: 1
 <1><a5f>: Abbrev Number: 0
  Compilation Unit @ offset 0xa60:
   Length:        0x1e (32-bit)
   Version:       2
   Abbrev Offset: 0x463
   Pointer Size:  4
 <0><a6b>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <a6c>   DW_AT_stmt_list   : 0x1a6b
    <a70>   DW_AT_ranges      : 0xa0
    <a74>   DW_AT_name        : (indirect string, offset: 0x7ab30): ../Core/Startup/startup_stm32f103c8tx.s
    <a78>   DW_AT_comp_dir    : (indirect string, offset: 0x38bca): D:/github/mc/stm32/test2/test2/Debug
    <a7c>   DW_AT_producer    : (indirect string, offset: 0x7ab58): GNU AS 2.36.1
    <a80>   DW_AT_language    : 32769	(MIPS assembler)
  Compilation Unit @ offset 0xa82:
   Length:        0x730 (32-bit)
   Version:       4
   Abbrev Offset: 0x475
   Pointer Size:  4
 <0><a8d>: Abbrev Number: 1 (DW_TAG_compile_unit)
    <a8e>   DW_AT_producer    : (indirect string, offset: 0x3e72a): GNU C11 10.3.1 20210824 (release) -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage
    <a92>   DW_AT_language    : 12	(ANSI C99)
    <a93>   DW_AT_name        : (indirect string, offset: 0x7ad1f): ../Drivers/STM32F1xx_HAL_Driver/Src/stm32f1xx_hal.c
    <a97>   DW_AT_comp_dir    : (indirect string, offset: 0x38bca): D:/github/mc/stm32/test2/test2/Debug
    <a9b>   DW_AT_ranges      : 0xc0
    <a9f>   DW_AT_low_pc      : 0x0
    <aa3>   DW_AT_stmt_list   : 0x1af2
    <aa7>   DW_AT_GNU_macros  : 0x151f6
 <1><aab>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <aac>   DW_AT_encoding    : 5	(signed)
    <aad>   DW_AT_byte_size   : 1
    <aae>   DW_AT_type        : <0xbf2>
    <ab2>   DW_AT_decl_file   : 2
    <ab3>   DW_AT_decl_line   : 70
    <ab4>   DW_AT_decl_column : 1
    <ab5>   DW_AT_sibling     : <0xbf2>
 <2><ab9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <aba>   DW_AT_name        : (indirect string, offset: 0x7ac5f): NonMaskableInt_IRQn
    <abe>   DW_AT_const_value : -14
 <2><abf>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ac0>   DW_AT_name        : (indirect string, offset: 0x7abfb): HardFault_IRQn
    <ac4>   DW_AT_const_value : -13
 <2><ac5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ac6>   DW_AT_name        : (indirect string, offset: 0x7ae4f): MemoryManagement_IRQn
    <aca>   DW_AT_const_value : -12
 <2><acb>: Abbrev Number: 3 (DW_TAG_enumerator)
    <acc>   DW_AT_name        : (indirect string, offset: 0x7b051): BusFault_IRQn
    <ad0>   DW_AT_const_value : -11
 <2><ad1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ad2>   DW_AT_name        : (indirect string, offset: 0x7af0e): UsageFault_IRQn
    <ad6>   DW_AT_const_value : -10
 <2><ad7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ad8>   DW_AT_name        : (indirect string, offset: 0x7ab70): SVCall_IRQn
    <adc>   DW_AT_const_value : -5
 <2><add>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ade>   DW_AT_name        : (indirect string, offset: 0x7ae65): DebugMonitor_IRQn
    <ae2>   DW_AT_const_value : -4
 <2><ae3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ae4>   DW_AT_name        : (indirect string, offset: 0x7aea9): PendSV_IRQn
    <ae8>   DW_AT_const_value : -2
 <2><ae9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <aea>   DW_AT_name        : (indirect string, offset: 0x7b07f): SysTick_IRQn
    <aee>   DW_AT_const_value : -1
 <2><aef>: Abbrev Number: 4 (DW_TAG_enumerator)
    <af0>   DW_AT_name        : (indirect string, offset: 0x7af4a): WWDG_IRQn
    <af4>   DW_AT_const_value : 0
 <2><af5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <af6>   DW_AT_name        : (indirect string, offset: 0x7ac56): PVD_IRQn
    <afa>   DW_AT_const_value : 1
 <2><afb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <afc>   DW_AT_name        : (indirect string, offset: 0x7ad6c): TAMPER_IRQn
    <b00>   DW_AT_const_value : 2
 <2><b01>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b02>   DW_AT_name        : (indirect string, offset: 0x7ae82): RTC_IRQn
    <b06>   DW_AT_const_value : 3
 <2><b07>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b08>   DW_AT_name        : (indirect string, offset: 0x7acd8): FLASH_IRQn
    <b0c>   DW_AT_const_value : 4
 <2><b0d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b0e>   DW_AT_name        : (indirect string, offset: 0x7b048): RCC_IRQn
    <b12>   DW_AT_const_value : 5
 <2><b13>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b14>   DW_AT_name        : (indirect string, offset: 0x7ae77): EXTI0_IRQn
    <b18>   DW_AT_const_value : 6
 <2><b19>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b1a>   DW_AT_name        : (indirect string, offset: 0x7b11d): EXTI1_IRQn
    <b1e>   DW_AT_const_value : 7
 <2><b1f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b20>   DW_AT_name        : (indirect string, offset: 0x7adf9): EXTI2_IRQn
    <b24>   DW_AT_const_value : 8
 <2><b25>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b26>   DW_AT_name        : (indirect string, offset: 0x7b08c): EXTI3_IRQn
    <b2a>   DW_AT_const_value : 9
 <2><b2b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b2c>   DW_AT_name        : (indirect string, offset: 0x7ac4b): EXTI4_IRQn
    <b30>   DW_AT_const_value : 10
 <2><b31>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b32>   DW_AT_name        : (indirect string, offset: 0x7acfc): DMA1_Channel1_IRQn
    <b36>   DW_AT_const_value : 11
 <2><b37>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b38>   DW_AT_name        : (indirect string, offset: 0x7af60): DMA1_Channel2_IRQn
    <b3c>   DW_AT_const_value : 12
 <2><b3d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b3e>   DW_AT_name        : (indirect string, offset: 0x7ac2b): DMA1_Channel3_IRQn
    <b42>   DW_AT_const_value : 13
 <2><b43>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b44>   DW_AT_name        : (indirect string, offset: 0x7aece): DMA1_Channel4_IRQn
    <b48>   DW_AT_const_value : 14
 <2><b49>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b4a>   DW_AT_name        : (indirect string, offset: 0x7ab97): DMA1_Channel5_IRQn
    <b4e>   DW_AT_const_value : 15
 <2><b4f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b50>   DW_AT_name        : (indirect string, offset: 0x7ae04): DMA1_Channel6_IRQn
    <b54>   DW_AT_const_value : 16
 <2><b55>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b56>   DW_AT_name        : (indirect string, offset: 0x7b0e8): DMA1_Channel7_IRQn
    <b5a>   DW_AT_const_value : 17
 <2><b5b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b5c>   DW_AT_name        : (indirect string, offset: 0x415a1): ADC1_2_IRQn
    <b60>   DW_AT_const_value : 18
 <2><b61>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b62>   DW_AT_name        : (indirect string, offset: 0x36495): USB_HP_CAN1_TX_IRQn
    <b66>   DW_AT_const_value : 19
 <2><b67>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b68>   DW_AT_name        : (indirect string, offset: 0x75acd): USB_LP_CAN1_RX0_IRQn
    <b6c>   DW_AT_const_value : 20
 <2><b6d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b6e>   DW_AT_name        : (indirect string, offset: 0x7af3c): CAN1_RX1_IRQn
    <b72>   DW_AT_const_value : 21
 <2><b73>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b74>   DW_AT_name        : (indirect string, offset: 0x7af1e): CAN1_SCE_IRQn
    <b78>   DW_AT_const_value : 22
 <2><b79>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b7a>   DW_AT_name        : (indirect string, offset: 0x7b0fb): EXTI9_5_IRQn
    <b7e>   DW_AT_const_value : 23
 <2><b7f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b80>   DW_AT_name        : (indirect string, offset: 0x22397): TIM1_BRK_IRQn
    <b84>   DW_AT_const_value : 24
 <2><b85>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b86>   DW_AT_name        : (indirect string, offset: 0x48e40): TIM1_UP_IRQn
    <b8a>   DW_AT_const_value : 25
 <2><b8b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b8c>   DW_AT_name        : (indirect string, offset: 0x27b17): TIM1_TRG_COM_IRQn
    <b90>   DW_AT_const_value : 26
 <2><b91>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b92>   DW_AT_name        : (indirect string, offset: 0x7b02e): TIM1_CC_IRQn
    <b96>   DW_AT_const_value : 27
 <2><b97>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b98>   DW_AT_name        : (indirect string, offset: 0x7ac21): TIM2_IRQn
    <b9c>   DW_AT_const_value : 28
 <2><b9d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <b9e>   DW_AT_name        : (indirect string, offset: 0x7aec4): TIM3_IRQn
    <ba2>   DW_AT_const_value : 29
 <2><ba3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <ba4>   DW_AT_name        : (indirect string, offset: 0x7ad62): TIM4_IRQn
    <ba8>   DW_AT_const_value : 30
 <2><ba9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <baa>   DW_AT_name        : (indirect string, offset: 0x7ad7e): I2C1_EV_IRQn
    <bae>   DW_AT_const_value : 31
 <2><baf>: Abbrev Number: 4 (DW_TAG_enumerator)
    <bb0>   DW_AT_name        : (indirect string, offset: 0x7aee1): I2C1_ER_IRQn
    <bb4>   DW_AT_const_value : 32
 <2><bb5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <bb6>   DW_AT_name        : (indirect string, offset: 0x7ac0a): I2C2_EV_IRQn
    <bba>   DW_AT_const_value : 33
 <2><bbb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <bbc>   DW_AT_name        : (indirect string, offset: 0x7adec): I2C2_ER_IRQn
    <bc0>   DW_AT_const_value : 34
 <2><bc1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <bc2>   DW_AT_name        : (indirect string, offset: 0x7ac17): SPI1_IRQn
    <bc6>   DW_AT_const_value : 35
 <2><bc7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <bc8>   DW_AT_name        : (indirect string, offset: 0x7aeba): SPI2_IRQn
    <bcc>   DW_AT_const_value : 36
 <2><bcd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <bce>   DW_AT_name        : (indirect string, offset: 0x7b05f): USART1_IRQn
    <bd2>   DW_AT_const_value : 37
 <2><bd3>: Abbrev Number: 4 (DW_TAG_enumerator)
    <bd4>   DW_AT_name        : (indirect string, offset: 0x7acf0): USART2_IRQn
    <bd8>   DW_AT_const_value : 38
 <2><bd9>: Abbrev Number: 4 (DW_TAG_enumerator)
    <bda>   DW_AT_name        : (indirect string, offset: 0x7af54): USART3_IRQn
    <bde>   DW_AT_const_value : 39
 <2><bdf>: Abbrev Number: 4 (DW_TAG_enumerator)
    <be0>   DW_AT_name        : (indirect string, offset: 0x7b0b9): EXTI15_10_IRQn
    <be4>   DW_AT_const_value : 40
 <2><be5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <be6>   DW_AT_name        : (indirect string, offset: 0x7b0cf): RTC_Alarm_IRQn
    <bea>   DW_AT_const_value : 41
 <2><beb>: Abbrev Number: 4 (DW_TAG_enumerator)
    <bec>   DW_AT_name        : (indirect string, offset: 0x76228): USBWakeUp_IRQn
    <bf0>   DW_AT_const_value : 42
 <2><bf1>: Abbrev Number: 0
 <1><bf2>: Abbrev Number: 5 (DW_TAG_base_type)
    <bf3>   DW_AT_byte_size   : 1
    <bf4>   DW_AT_encoding    : 6	(signed char)
    <bf5>   DW_AT_name        : (indirect string, offset: 0x3da6f): signed char
 <1><bf9>: Abbrev Number: 6 (DW_TAG_typedef)
    <bfa>   DW_AT_name        : (indirect string, offset: 0x7b0de): IRQn_Type
    <bfe>   DW_AT_decl_file   : 2
    <bff>   DW_AT_decl_line   : 126
    <c00>   DW_AT_decl_column : 3
    <c01>   DW_AT_type        : <0xaab>
 <1><c05>: Abbrev Number: 5 (DW_TAG_base_type)
    <c06>   DW_AT_byte_size   : 1
    <c07>   DW_AT_encoding    : 8	(unsigned char)
    <c08>   DW_AT_name        : (indirect string, offset: 0x1917f): unsigned char
 <1><c0c>: Abbrev Number: 5 (DW_TAG_base_type)
    <c0d>   DW_AT_byte_size   : 2
    <c0e>   DW_AT_encoding    : 5	(signed)
    <c0f>   DW_AT_name        : (indirect string, offset: 0x5b49f): short int
 <1><c13>: Abbrev Number: 5 (DW_TAG_base_type)
    <c14>   DW_AT_byte_size   : 2
    <c15>   DW_AT_encoding    : 7	(unsigned)
    <c16>   DW_AT_name        : (indirect string, offset: 0x286aa): short unsigned int
 <1><c1a>: Abbrev Number: 5 (DW_TAG_base_type)
    <c1b>   DW_AT_byte_size   : 4
    <c1c>   DW_AT_encoding    : 5	(signed)
    <c1d>   DW_AT_name        : (indirect string, offset: 0xaa54): long int
 <1><c21>: Abbrev Number: 6 (DW_TAG_typedef)
    <c22>   DW_AT_name        : (indirect string, offset: 0x4e26e): __uint32_t
    <c26>   DW_AT_decl_file   : 3
    <c27>   DW_AT_decl_line   : 79
    <c28>   DW_AT_decl_column : 25
    <c29>   DW_AT_type        : <0xc2d>
 <1><c2d>: Abbrev Number: 5 (DW_TAG_base_type)
    <c2e>   DW_AT_byte_size   : 4
    <c2f>   DW_AT_encoding    : 7	(unsigned)
    <c30>   DW_AT_name        : (indirect string, offset: 0x1d0e9): long unsigned int
 <1><c34>: Abbrev Number: 5 (DW_TAG_base_type)
    <c35>   DW_AT_byte_size   : 8
    <c36>   DW_AT_encoding    : 5	(signed)
    <c37>   DW_AT_name        : (indirect string, offset: 0x38898): long long int
 <1><c3b>: Abbrev Number: 5 (DW_TAG_base_type)
    <c3c>   DW_AT_byte_size   : 8
    <c3d>   DW_AT_encoding    : 7	(unsigned)
    <c3e>   DW_AT_name        : (indirect string, offset: 0x1992d): long long unsigned int
 <1><c42>: Abbrev Number: 7 (DW_TAG_base_type)
    <c43>   DW_AT_byte_size   : 4
    <c44>   DW_AT_encoding    : 5	(signed)
    <c45>   DW_AT_name        : int
 <1><c49>: Abbrev Number: 5 (DW_TAG_base_type)
    <c4a>   DW_AT_byte_size   : 4
    <c4b>   DW_AT_encoding    : 7	(unsigned)
    <c4c>   DW_AT_name        : (indirect string, offset: 0xa417): unsigned int
 <1><c50>: Abbrev Number: 6 (DW_TAG_typedef)
    <c51>   DW_AT_name        : (indirect string, offset: 0x4e270): uint32_t
    <c55>   DW_AT_decl_file   : 4
    <c56>   DW_AT_decl_line   : 48
    <c57>   DW_AT_decl_column : 20
    <c58>   DW_AT_type        : <0xc21>
 <1><c5c>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <c5d>   DW_AT_type        : <0xc50>
 <1><c61>: Abbrev Number: 9 (DW_TAG_const_type)
    <c62>   DW_AT_type        : <0xc5c>
 <1><c66>: Abbrev Number: 10 (DW_TAG_structure_type)
    <c67>   DW_AT_byte_size   : 16
    <c68>   DW_AT_decl_file   : 5
    <c69>   DW_AT_decl_line   : 694
    <c6b>   DW_AT_decl_column : 9
    <c6c>   DW_AT_sibling     : <0xca9>
 <2><c70>: Abbrev Number: 11 (DW_TAG_member)
    <c71>   DW_AT_name        : (indirect string, offset: 0x7aeb5): CTRL
    <c75>   DW_AT_decl_file   : 5
    <c76>   DW_AT_decl_line   : 696
    <c78>   DW_AT_decl_column : 18
    <c79>   DW_AT_type        : <0xc5c>
    <c7d>   DW_AT_data_member_location: 0
 <2><c7e>: Abbrev Number: 11 (DW_TAG_member)
    <c7f>   DW_AT_name        : (indirect string, offset: 0x630eb): LOAD
    <c83>   DW_AT_decl_file   : 5
    <c84>   DW_AT_decl_line   : 697
    <c86>   DW_AT_decl_column : 18
    <c87>   DW_AT_type        : <0xc5c>
    <c8b>   DW_AT_data_member_location: 4
 <2><c8c>: Abbrev Number: 12 (DW_TAG_member)
    <c8d>   DW_AT_name        : VAL
    <c91>   DW_AT_decl_file   : 5
    <c92>   DW_AT_decl_line   : 698
    <c94>   DW_AT_decl_column : 18
    <c95>   DW_AT_type        : <0xc5c>
    <c99>   DW_AT_data_member_location: 8
 <2><c9a>: Abbrev Number: 11 (DW_TAG_member)
    <c9b>   DW_AT_name        : (indirect string, offset: 0x7ad78): CALIB
    <c9f>   DW_AT_decl_file   : 5
    <ca0>   DW_AT_decl_line   : 699
    <ca2>   DW_AT_decl_column : 18
    <ca3>   DW_AT_type        : <0xc61>
    <ca7>   DW_AT_data_member_location: 12
 <2><ca8>: Abbrev Number: 0
 <1><ca9>: Abbrev Number: 13 (DW_TAG_typedef)
    <caa>   DW_AT_name        : (indirect string, offset: 0x7ace3): SysTick_Type
    <cae>   DW_AT_decl_file   : 5
    <caf>   DW_AT_decl_line   : 700
    <cb1>   DW_AT_decl_column : 3
    <cb2>   DW_AT_type        : <0xc66>
 <1><cb6>: Abbrev Number: 14 (DW_TAG_variable)
    <cb7>   DW_AT_name        : (indirect string, offset: 0x7ab12): SystemCoreClock
    <cbb>   DW_AT_decl_file   : 8
    <cbc>   DW_AT_decl_line   : 51
    <cbd>   DW_AT_decl_column : 17
    <cbe>   DW_AT_type        : <0xc50>
    <cc2>   DW_AT_external    : 1
    <cc2>   DW_AT_declaration : 1
 <1><cc2>: Abbrev Number: 10 (DW_TAG_structure_type)
    <cc3>   DW_AT_byte_size   : 8
    <cc4>   DW_AT_decl_file   : 2
    <cc5>   DW_AT_decl_line   : 281
    <cc7>   DW_AT_decl_column : 9
    <cc8>   DW_AT_sibling     : <0xce8>
 <2><ccc>: Abbrev Number: 11 (DW_TAG_member)
    <ccd>   DW_AT_name        : (indirect string, offset: 0x7b0c8): IDCODE
    <cd1>   DW_AT_decl_file   : 2
    <cd2>   DW_AT_decl_line   : 283
    <cd4>   DW_AT_decl_column : 17
    <cd5>   DW_AT_type        : <0xc5c>
    <cd9>   DW_AT_data_member_location: 0
 <2><cda>: Abbrev Number: 12 (DW_TAG_member)
    <cdb>   DW_AT_name        : CR
    <cde>   DW_AT_decl_file   : 2
    <cdf>   DW_AT_decl_line   : 284
    <ce1>   DW_AT_decl_column : 17
    <ce2>   DW_AT_type        : <0xc5c>
    <ce6>   DW_AT_data_member_location: 4
 <2><ce7>: Abbrev Number: 0
 <1><ce8>: Abbrev Number: 13 (DW_TAG_typedef)
    <ce9>   DW_AT_name        : (indirect string, offset: 0x7ad53): DBGMCU_TypeDef
    <ced>   DW_AT_decl_file   : 2
    <cee>   DW_AT_decl_line   : 285
    <cf0>   DW_AT_decl_column : 2
    <cf1>   DW_AT_type        : <0xcc2>
 <1><cf5>: Abbrev Number: 10 (DW_TAG_structure_type)
    <cf6>   DW_AT_byte_size   : 36
    <cf7>   DW_AT_decl_file   : 2
    <cf8>   DW_AT_decl_line   : 325
    <cfa>   DW_AT_decl_column : 9
    <cfb>   DW_AT_sibling     : <0xd7b>
 <2><cff>: Abbrev Number: 12 (DW_TAG_member)
    <d00>   DW_AT_name        : ACR
    <d04>   DW_AT_decl_file   : 2
    <d05>   DW_AT_decl_line   : 327
    <d07>   DW_AT_decl_column : 17
    <d08>   DW_AT_type        : <0xc5c>
    <d0c>   DW_AT_data_member_location: 0
 <2><d0d>: Abbrev Number: 11 (DW_TAG_member)
    <d0e>   DW_AT_name        : (indirect string, offset: 0x7b149): KEYR
    <d12>   DW_AT_decl_file   : 2
    <d13>   DW_AT_decl_line   : 328
    <d15>   DW_AT_decl_column : 17
    <d16>   DW_AT_type        : <0xc5c>
    <d1a>   DW_AT_data_member_location: 4
 <2><d1b>: Abbrev Number: 11 (DW_TAG_member)
    <d1c>   DW_AT_name        : (indirect string, offset: 0x7b146): OPTKEYR
    <d20>   DW_AT_decl_file   : 2
    <d21>   DW_AT_decl_line   : 329
    <d23>   DW_AT_decl_column : 17
    <d24>   DW_AT_type        : <0xc5c>
    <d28>   DW_AT_data_member_location: 8
 <2><d29>: Abbrev Number: 12 (DW_TAG_member)
    <d2a>   DW_AT_name        : SR
    <d2d>   DW_AT_decl_file   : 2
    <d2e>   DW_AT_decl_line   : 330
    <d30>   DW_AT_decl_column : 17
    <d31>   DW_AT_type        : <0xc5c>
    <d35>   DW_AT_data_member_location: 12
 <2><d36>: Abbrev Number: 12 (DW_TAG_member)
    <d37>   DW_AT_name        : CR
    <d3a>   DW_AT_decl_file   : 2
    <d3b>   DW_AT_decl_line   : 331
    <d3d>   DW_AT_decl_column : 17
    <d3e>   DW_AT_type        : <0xc5c>
    <d42>   DW_AT_data_member_location: 16
 <2><d43>: Abbrev Number: 12 (DW_TAG_member)
    <d44>   DW_AT_name        : AR
    <d47>   DW_AT_decl_file   : 2
    <d48>   DW_AT_decl_line   : 332
    <d4a>   DW_AT_decl_column : 17
    <d4b>   DW_AT_type        : <0xc5c>
    <d4f>   DW_AT_data_member_location: 20
 <2><d50>: Abbrev Number: 11 (DW_TAG_member)
    <d51>   DW_AT_name        : (indirect string, offset: 0x4a769): RESERVED
    <d55>   DW_AT_decl_file   : 2
    <d56>   DW_AT_decl_line   : 333
    <d58>   DW_AT_decl_column : 17
    <d59>   DW_AT_type        : <0xc5c>
    <d5d>   DW_AT_data_member_location: 24
 <2><d5e>: Abbrev Number: 12 (DW_TAG_member)
    <d5f>   DW_AT_name        : OBR
    <d63>   DW_AT_decl_file   : 2
    <d64>   DW_AT_decl_line   : 334
    <d66>   DW_AT_decl_column : 17
    <d67>   DW_AT_type        : <0xc5c>
    <d6b>   DW_AT_data_member_location: 28
 <2><d6c>: Abbrev Number: 11 (DW_TAG_member)
    <d6d>   DW_AT_name        : (indirect string, offset: 0x7b118): WRPR
    <d71>   DW_AT_decl_file   : 2
    <d72>   DW_AT_decl_line   : 335
    <d74>   DW_AT_decl_column : 17
    <d75>   DW_AT_type        : <0xc5c>
    <d79>   DW_AT_data_member_location: 32
 <2><d7a>: Abbrev Number: 0
 <1><d7b>: Abbrev Number: 13 (DW_TAG_typedef)
    <d7c>   DW_AT_name        : (indirect string, offset: 0x7af00): FLASH_TypeDef
    <d80>   DW_AT_decl_file   : 2
    <d81>   DW_AT_decl_line   : 336
    <d83>   DW_AT_decl_column : 3
    <d84>   DW_AT_type        : <0xcf5>
 <1><d88>: Abbrev Number: 10 (DW_TAG_structure_type)
    <d89>   DW_AT_byte_size   : 40
    <d8a>   DW_AT_decl_file   : 2
    <d8b>   DW_AT_decl_line   : 424
    <d8d>   DW_AT_decl_column : 9
    <d8e>   DW_AT_sibling     : <0xe1e>
 <2><d92>: Abbrev Number: 12 (DW_TAG_member)
    <d93>   DW_AT_name        : CR
    <d96>   DW_AT_decl_file   : 2
    <d97>   DW_AT_decl_line   : 426
    <d99>   DW_AT_decl_column : 17
    <d9a>   DW_AT_type        : <0xc5c>
    <d9e>   DW_AT_data_member_location: 0
 <2><d9f>: Abbrev Number: 11 (DW_TAG_member)
    <da0>   DW_AT_name        : (indirect string, offset: 0x4aa9e): CFGR
    <da4>   DW_AT_decl_file   : 2
    <da5>   DW_AT_decl_line   : 427
    <da7>   DW_AT_decl_column : 17
    <da8>   DW_AT_type        : <0xc5c>
    <dac>   DW_AT_data_member_location: 4
 <2><dad>: Abbrev Number: 12 (DW_TAG_member)
    <dae>   DW_AT_name        : CIR
    <db2>   DW_AT_decl_file   : 2
    <db3>   DW_AT_decl_line   : 428
    <db5>   DW_AT_decl_column : 17
    <db6>   DW_AT_type        : <0xc5c>
    <dba>   DW_AT_data_member_location: 8
 <2><dbb>: Abbrev Number: 11 (DW_TAG_member)
    <dbc>   DW_AT_name        : (indirect string, offset: 0x35c15): APB2RSTR
    <dc0>   DW_AT_decl_file   : 2
    <dc1>   DW_AT_decl_line   : 429
    <dc3>   DW_AT_decl_column : 17
    <dc4>   DW_AT_type        : <0xc5c>
    <dc8>   DW_AT_data_member_location: 12
 <2><dc9>: Abbrev Number: 11 (DW_TAG_member)
    <dca>   DW_AT_name        : (indirect string, offset: 0xe01d): APB1RSTR
    <dce>   DW_AT_decl_file   : 2
    <dcf>   DW_AT_decl_line   : 430
    <dd1>   DW_AT_decl_column : 17
    <dd2>   DW_AT_type        : <0xc5c>
    <dd6>   DW_AT_data_member_location: 16
 <2><dd7>: Abbrev Number: 11 (DW_TAG_member)
    <dd8>   DW_AT_name        : (indirect string, offset: 0xb7d8): AHBENR
    <ddc>   DW_AT_decl_file   : 2
    <ddd>   DW_AT_decl_line   : 431
    <ddf>   DW_AT_decl_column : 17
    <de0>   DW_AT_type        : <0xc5c>
    <de4>   DW_AT_data_member_location: 20
 <2><de5>: Abbrev Number: 11 (DW_TAG_member)
    <de6>   DW_AT_name        : (indirect string, offset: 0xe9b5): APB2ENR
    <dea>   DW_AT_decl_file   : 2
    <deb>   DW_AT_decl_line   : 432
    <ded>   DW_AT_decl_column : 17
    <dee>   DW_AT_type        : <0xc5c>
    <df2>   DW_AT_data_member_location: 24
 <2><df3>: Abbrev Number: 11 (DW_TAG_member)
    <df4>   DW_AT_name        : (indirect string, offset: 0x5c337): APB1ENR
    <df8>   DW_AT_decl_file   : 2
    <df9>   DW_AT_decl_line   : 433
    <dfb>   DW_AT_decl_column : 17
    <dfc>   DW_AT_type        : <0xc5c>
    <e00>   DW_AT_data_member_location: 28
 <2><e01>: Abbrev Number: 11 (DW_TAG_member)
    <e02>   DW_AT_name        : (indirect string, offset: 0x11037): BDCR
    <e06>   DW_AT_decl_file   : 2
    <e07>   DW_AT_decl_line   : 434
    <e09>   DW_AT_decl_column : 17
    <e0a>   DW_AT_type        : <0xc5c>
    <e0e>   DW_AT_data_member_location: 32
 <2><e0f>: Abbrev Number: 12 (DW_TAG_member)
    <e10>   DW_AT_name        : CSR
    <e14>   DW_AT_decl_file   : 2
    <e15>   DW_AT_decl_line   : 435
    <e17>   DW_AT_decl_column : 17
    <e18>   DW_AT_type        : <0xc5c>
    <e1c>   DW_AT_data_member_location: 36
 <2><e1d>: Abbrev Number: 0
 <1><e1e>: Abbrev Number: 13 (DW_TAG_typedef)
    <e1f>   DW_AT_name        : (indirect string, offset: 0x39663): RCC_TypeDef
    <e23>   DW_AT_decl_file   : 2
    <e24>   DW_AT_decl_line   : 438
    <e26>   DW_AT_decl_column : 3
    <e27>   DW_AT_type        : <0xd88>
 <1><e2b>: Abbrev Number: 5 (DW_TAG_base_type)
    <e2c>   DW_AT_byte_size   : 8
    <e2d>   DW_AT_encoding    : 4	(float)
    <e2e>   DW_AT_name        : (indirect string, offset: 0x13834): long double
 <1><e32>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <e33>   DW_AT_encoding    : 7	(unsigned)
    <e34>   DW_AT_byte_size   : 1
    <e35>   DW_AT_type        : <0xc05>
    <e39>   DW_AT_decl_file   : 6
    <e3a>   DW_AT_decl_line   : 40
    <e3b>   DW_AT_decl_column : 1
    <e3c>   DW_AT_sibling     : <0xe59>
 <2><e40>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e41>   DW_AT_name        : (indirect string, offset: 0x29a90): HAL_OK
    <e45>   DW_AT_const_value : 0
 <2><e46>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e47>   DW_AT_name        : (indirect string, offset: 0x4ccd0): HAL_ERROR
    <e4b>   DW_AT_const_value : 1
 <2><e4c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e4d>   DW_AT_name        : (indirect string, offset: 0x15966): HAL_BUSY
    <e51>   DW_AT_const_value : 2
 <2><e52>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e53>   DW_AT_name        : (indirect string, offset: 0x2453e): HAL_TIMEOUT
    <e57>   DW_AT_const_value : 3
 <2><e58>: Abbrev Number: 0
 <1><e59>: Abbrev Number: 6 (DW_TAG_typedef)
    <e5a>   DW_AT_name        : (indirect string, offset: 0x1567): HAL_StatusTypeDef
    <e5e>   DW_AT_decl_file   : 6
    <e5f>   DW_AT_decl_line   : 45
    <e60>   DW_AT_decl_column : 3
    <e61>   DW_AT_type        : <0xe32>
 <1><e65>: Abbrev Number: 2 (DW_TAG_enumeration_type)
    <e66>   DW_AT_encoding    : 7	(unsigned)
    <e67>   DW_AT_byte_size   : 1
    <e68>   DW_AT_type        : <0xc05>
    <e6c>   DW_AT_decl_file   : 7
    <e6d>   DW_AT_decl_line   : 50
    <e6e>   DW_AT_decl_column : 1
    <e6f>   DW_AT_sibling     : <0xe8c>
 <2><e73>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e74>   DW_AT_name        : (indirect string, offset: 0x7ae8b): HAL_TICK_FREQ_10HZ
    <e78>   DW_AT_const_value : 100
 <2><e79>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e7a>   DW_AT_name        : (indirect string, offset: 0x7add8): HAL_TICK_FREQ_100HZ
    <e7e>   DW_AT_const_value : 10
 <2><e7f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e80>   DW_AT_name        : (indirect string, offset: 0x7ae17): HAL_TICK_FREQ_1KHZ
    <e84>   DW_AT_const_value : 1
 <2><e85>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e86>   DW_AT_name        : (indirect string, offset: 0x7adc2): HAL_TICK_FREQ_DEFAULT
    <e8a>   DW_AT_const_value : 1
 <2><e8b>: Abbrev Number: 0
 <1><e8c>: Abbrev Number: 6 (DW_TAG_typedef)
    <e8d>   DW_AT_name        : (indirect string, offset: 0x7b06b): HAL_TickFreqTypeDef
    <e91>   DW_AT_decl_file   : 7
    <e92>   DW_AT_decl_line   : 55
    <e93>   DW_AT_decl_column : 3
    <e94>   DW_AT_type        : <0xe65>
 <1><e98>: Abbrev Number: 14 (DW_TAG_variable)
    <e99>   DW_AT_name        : (indirect string, offset: 0x7af73): uwTick
    <e9d>   DW_AT_decl_file   : 7
    <e9e>   DW_AT_decl_line   : 60
    <e9f>   DW_AT_decl_column : 22
    <ea0>   DW_AT_type        : <0xc5c>
    <ea4>   DW_AT_external    : 1
    <ea4>   DW_AT_declaration : 1
 <1><ea4>: Abbrev Number: 14 (DW_TAG_variable)
    <ea5>   DW_AT_name        : (indirect string, offset: 0x7b023): uwTickPrio
    <ea9>   DW_AT_decl_file   : 7
    <eaa>   DW_AT_decl_line   : 61
    <eab>   DW_AT_decl_column : 17
    <eac>   DW_AT_type        : <0xc50>
    <eb0>   DW_AT_external    : 1
    <eb0>   DW_AT_declaration : 1
 <1><eb0>: Abbrev Number: 14 (DW_TAG_variable)
    <eb1>   DW_AT_name        : (indirect string, offset: 0x7b10d): uwTickFreq
    <eb5>   DW_AT_decl_file   : 7
    <eb6>   DW_AT_decl_line   : 62
    <eb7>   DW_AT_decl_column : 28
    <eb8>   DW_AT_type        : <0xe8c>
    <ebc>   DW_AT_external    : 1
    <ebc>   DW_AT_declaration : 1
 <1><ebc>: Abbrev Number: 15 (DW_TAG_variable)
    <ebd>   DW_AT_specification: <0xe98>
    <ec1>   DW_AT_decl_file   : 1
    <ec2>   DW_AT_decl_line   : 79
    <ec3>   DW_AT_decl_column : 15
    <ec4>   DW_AT_location    : 5 byte block: 3 28 0 0 20 	(DW_OP_addr: 20000028)
 <1><eca>: Abbrev Number: 15 (DW_TAG_variable)
    <ecb>   DW_AT_specification: <0xea4>
    <ecf>   DW_AT_decl_file   : 1
    <ed0>   DW_AT_decl_line   : 80
    <ed1>   DW_AT_decl_column : 10
    <ed2>   DW_AT_location    : 5 byte block: 3 4 0 0 20 	(DW_OP_addr: 20000004)
 <1><ed8>: Abbrev Number: 15 (DW_TAG_variable)
    <ed9>   DW_AT_specification: <0xeb0>
    <edd>   DW_AT_decl_file   : 1
    <ede>   DW_AT_decl_line   : 81
    <edf>   DW_AT_decl_column : 21
    <ee0>   DW_AT_location    : 5 byte block: 3 8 0 0 20 	(DW_OP_addr: 20000008)
 <1><ee6>: Abbrev Number: 16 (DW_TAG_subprogram)
    <ee7>   DW_AT_external    : 1
    <ee7>   DW_AT_name        : (indirect string, offset: 0x7b0a4): HAL_NVIC_SetPriority
    <eeb>   DW_AT_decl_file   : 9
    <eec>   DW_AT_decl_line   : 263
    <eee>   DW_AT_decl_column : 6
    <eef>   DW_AT_prototyped  : 1
    <eef>   DW_AT_declaration : 1
    <eef>   DW_AT_sibling     : <0xf03>
 <2><ef3>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <ef4>   DW_AT_type        : <0xbf9>
 <2><ef8>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <ef9>   DW_AT_type        : <0xc50>
 <2><efd>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <efe>   DW_AT_type        : <0xc50>
 <2><f02>: Abbrev Number: 0
 <1><f03>: Abbrev Number: 18 (DW_TAG_subprogram)
    <f04>   DW_AT_external    : 1
    <f04>   DW_AT_name        : (indirect string, offset: 0x7b14e): HAL_SYSTICK_Config
    <f08>   DW_AT_decl_file   : 9
    <f09>   DW_AT_decl_line   : 267
    <f0b>   DW_AT_decl_column : 10
    <f0c>   DW_AT_prototyped  : 1
    <f0c>   DW_AT_type        : <0xc50>
    <f10>   DW_AT_declaration : 1
    <f10>   DW_AT_sibling     : <0xf1a>
 <2><f14>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <f15>   DW_AT_type        : <0xc50>
 <2><f19>: Abbrev Number: 0
 <1><f1a>: Abbrev Number: 16 (DW_TAG_subprogram)
    <f1b>   DW_AT_external    : 1
    <f1b>   DW_AT_name        : (indirect string, offset: 0x7abcf): HAL_NVIC_SetPriorityGrouping
    <f1f>   DW_AT_decl_file   : 9
    <f20>   DW_AT_decl_line   : 262
    <f22>   DW_AT_decl_column : 6
    <f23>   DW_AT_prototyped  : 1
    <f23>   DW_AT_declaration : 1
    <f23>   DW_AT_sibling     : <0xf2d>
 <2><f27>: Abbrev Number: 17 (DW_TAG_formal_parameter)
    <f28>   DW_AT_type        : <0xc50>
 <2><f2c>: Abbrev Number: 0
 <1><f2d>: Abbrev Number: 19 (DW_TAG_subprogram)
    <f2e>   DW_AT_external    : 1
    <f2e>   DW_AT_name        : (indirect string, offset: 0x5657e): HAL_DBGMCU_DisableDBGStandbyMode
    <f32>   DW_AT_decl_file   : 1
    <f33>   DW_AT_decl_line   : 584
    <f35>   DW_AT_decl_column : 6
    <f36>   DW_AT_prototyped  : 1
    <f36>   DW_AT_low_pc      : 0x0
    <f3a>   DW_AT_high_pc     : 0x1c
    <f3e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f40>   DW_AT_GNU_all_call_sites: 1
 <1><f40>: Abbrev Number: 19 (DW_TAG_subprogram)
    <f41>   DW_AT_external    : 1
    <f41>   DW_AT_name        : (indirect string, offset: 0x65e1f): HAL_DBGMCU_EnableDBGStandbyMode
    <f45>   DW_AT_decl_file   : 1
    <f46>   DW_AT_decl_line   : 568
    <f48>   DW_AT_decl_column : 6
    <f49>   DW_AT_prototyped  : 1
    <f49>   DW_AT_low_pc      : 0x0
    <f4d>   DW_AT_high_pc     : 0x1c
    <f51>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f53>   DW_AT_GNU_all_call_sites: 1
 <1><f53>: Abbrev Number: 19 (DW_TAG_subprogram)
    <f54>   DW_AT_external    : 1
    <f54>   DW_AT_name        : (indirect string, offset: 0x50401): HAL_DBGMCU_DisableDBGStopMode
    <f58>   DW_AT_decl_file   : 1
    <f59>   DW_AT_decl_line   : 552
    <f5b>   DW_AT_decl_column : 6
    <f5c>   DW_AT_prototyped  : 1
    <f5c>   DW_AT_low_pc      : 0x0
    <f60>   DW_AT_high_pc     : 0x1c
    <f64>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f66>   DW_AT_GNU_all_call_sites: 1
 <1><f66>: Abbrev Number: 19 (DW_TAG_subprogram)
    <f67>   DW_AT_external    : 1
    <f67>   DW_AT_name        : (indirect string, offset: 0xa496): HAL_DBGMCU_EnableDBGStopMode
    <f6b>   DW_AT_decl_file   : 1
    <f6c>   DW_AT_decl_line   : 536
    <f6e>   DW_AT_decl_column : 6
    <f6f>   DW_AT_prototyped  : 1
    <f6f>   DW_AT_low_pc      : 0x0
    <f73>   DW_AT_high_pc     : 0x1c
    <f77>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f79>   DW_AT_GNU_all_call_sites: 1
 <1><f79>: Abbrev Number: 19 (DW_TAG_subprogram)
    <f7a>   DW_AT_external    : 1
    <f7a>   DW_AT_name        : (indirect string, offset: 0x26d7a): HAL_DBGMCU_DisableDBGSleepMode
    <f7e>   DW_AT_decl_file   : 1
    <f7f>   DW_AT_decl_line   : 506
    <f81>   DW_AT_decl_column : 6
    <f82>   DW_AT_prototyped  : 1
    <f82>   DW_AT_low_pc      : 0x0
    <f86>   DW_AT_high_pc     : 0x1c
    <f8a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f8c>   DW_AT_GNU_all_call_sites: 1
 <1><f8c>: Abbrev Number: 19 (DW_TAG_subprogram)
    <f8d>   DW_AT_external    : 1
    <f8d>   DW_AT_name        : (indirect string, offset: 0x5f4a3): HAL_DBGMCU_EnableDBGSleepMode
    <f91>   DW_AT_decl_file   : 1
    <f92>   DW_AT_decl_line   : 490
    <f94>   DW_AT_decl_column : 6
    <f95>   DW_AT_prototyped  : 1
    <f95>   DW_AT_low_pc      : 0x0
    <f99>   DW_AT_high_pc     : 0x1c
    <f9d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f9f>   DW_AT_GNU_all_call_sites: 1
 <1><f9f>: Abbrev Number: 20 (DW_TAG_subprogram)
    <fa0>   DW_AT_external    : 1
    <fa0>   DW_AT_name        : (indirect string, offset: 0x7ada5): HAL_GetUIDw2
    <fa4>   DW_AT_decl_file   : 1
    <fa5>   DW_AT_decl_line   : 481
    <fa7>   DW_AT_decl_column : 10
    <fa8>   DW_AT_prototyped  : 1
    <fa8>   DW_AT_type        : <0xc50>
    <fac>   DW_AT_low_pc      : 0x0
    <fb0>   DW_AT_high_pc     : 0x14
    <fb4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fb6>   DW_AT_GNU_all_call_sites: 1
 <1><fb6>: Abbrev Number: 20 (DW_TAG_subprogram)
    <fb7>   DW_AT_external    : 1
    <fb7>   DW_AT_name        : (indirect string, offset: 0x7ad98): HAL_GetUIDw1
    <fbb>   DW_AT_decl_file   : 1
    <fbc>   DW_AT_decl_line   : 472
    <fbe>   DW_AT_decl_column : 10
    <fbf>   DW_AT_prototyped  : 1
    <fbf>   DW_AT_type        : <0xc50>
    <fc3>   DW_AT_low_pc      : 0x0
    <fc7>   DW_AT_high_pc     : 0x14
    <fcb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fcd>   DW_AT_GNU_all_call_sites: 1
 <1><fcd>: Abbrev Number: 20 (DW_TAG_subprogram)
    <fce>   DW_AT_external    : 1
    <fce>   DW_AT_name        : (indirect string, offset: 0x7ad8b): HAL_GetUIDw0
    <fd2>   DW_AT_decl_file   : 1
    <fd3>   DW_AT_decl_line   : 463
    <fd5>   DW_AT_decl_column : 10
    <fd6>   DW_AT_prototyped  : 1
    <fd6>   DW_AT_type        : <0xc50>
    <fda>   DW_AT_low_pc      : 0x0
    <fde>   DW_AT_high_pc     : 0x14
    <fe2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fe4>   DW_AT_GNU_all_call_sites: 1
 <1><fe4>: Abbrev Number: 20 (DW_TAG_subprogram)
    <fe5>   DW_AT_external    : 1
    <fe5>   DW_AT_name        : (indirect string, offset: 0x7b097): HAL_GetDEVID
    <fe9>   DW_AT_decl_file   : 1
    <fea>   DW_AT_decl_line   : 454
    <fec>   DW_AT_decl_column : 10
    <fed>   DW_AT_prototyped  : 1
    <fed>   DW_AT_type        : <0xc50>
    <ff1>   DW_AT_low_pc      : 0x0
    <ff5>   DW_AT_high_pc     : 0x18
    <ff9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ffb>   DW_AT_GNU_all_call_sites: 1
 <1><ffb>: Abbrev Number: 20 (DW_TAG_subprogram)
    <ffc>   DW_AT_external    : 1
    <ffc>   DW_AT_name        : (indirect string, offset: 0x7ab8a): HAL_GetREVID
    <1000>   DW_AT_decl_file   : 1
    <1001>   DW_AT_decl_line   : 438
    <1003>   DW_AT_decl_column : 10
    <1004>   DW_AT_prototyped  : 1
    <1004>   DW_AT_type        : <0xc50>
    <1008>   DW_AT_low_pc      : 0x0
    <100c>   DW_AT_high_pc     : 0x18
    <1010>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1012>   DW_AT_GNU_all_call_sites: 1
 <1><1012>: Abbrev Number: 20 (DW_TAG_subprogram)
    <1013>   DW_AT_external    : 1
    <1013>   DW_AT_name        : (indirect string, offset: 0x7aeee): HAL_GetHalVersion
    <1017>   DW_AT_decl_file   : 1
    <1018>   DW_AT_decl_line   : 422
    <101a>   DW_AT_decl_column : 10
    <101b>   DW_AT_prototyped  : 1
    <101b>   DW_AT_type        : <0xc50>
    <101f>   DW_AT_low_pc      : 0x0
    <1023>   DW_AT_high_pc     : 0x14
    <1027>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1029>   DW_AT_GNU_all_call_sites: 1
 <1><1029>: Abbrev Number: 19 (DW_TAG_subprogram)
    <102a>   DW_AT_external    : 1
    <102a>   DW_AT_name        : (indirect string, offset: 0x7abec): HAL_ResumeTick
    <102e>   DW_AT_decl_file   : 1
    <102f>   DW_AT_decl_line   : 412
    <1031>   DW_AT_decl_column : 13
    <1032>   DW_AT_prototyped  : 1
    <1032>   DW_AT_low_pc      : 0x0
    <1036>   DW_AT_high_pc     : 0x1c
    <103a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <103c>   DW_AT_GNU_all_call_sites: 1
 <1><103c>: Abbrev Number: 19 (DW_TAG_subprogram)
    <103d>   DW_AT_external    : 1
    <103d>   DW_AT_name        : (indirect string, offset: 0x7adb2): HAL_SuspendTick
    <1041>   DW_AT_decl_file   : 1
    <1042>   DW_AT_decl_line   : 396
    <1044>   DW_AT_decl_column : 13
    <1045>   DW_AT_prototyped  : 1
    <1045>   DW_AT_low_pc      : 0x0
    <1049>   DW_AT_high_pc     : 0x1c
    <104d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <104f>   DW_AT_GNU_all_call_sites: 1
 <1><104f>: Abbrev Number: 21 (DW_TAG_subprogram)
    <1050>   DW_AT_external    : 1
    <1050>   DW_AT_name        : (indirect string, offset: 0x31481): HAL_Delay
    <1054>   DW_AT_decl_file   : 1
    <1055>   DW_AT_decl_line   : 370
    <1057>   DW_AT_decl_column : 13
    <1058>   DW_AT_prototyped  : 1
    <1058>   DW_AT_low_pc      : 0x8000430
    <105c>   DW_AT_high_pc     : 0x48
    <1060>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1062>   DW_AT_GNU_all_tail_call_sites: 1
    <1062>   DW_AT_sibling     : <0x1097>
 <2><1066>: Abbrev Number: 22 (DW_TAG_formal_parameter)
    <1067>   DW_AT_name        : (indirect string, offset: 0x7b85e): Delay
    <106b>   DW_AT_decl_file   : 1
    <106c>   DW_AT_decl_line   : 370
    <106e>   DW_AT_decl_column : 32
    <106f>   DW_AT_type        : <0xc50>
    <1073>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><1076>: Abbrev Number: 23 (DW_TAG_variable)
    <1077>   DW_AT_name        : (indirect string, offset: 0x7ab66): tickstart
    <107b>   DW_AT_decl_file   : 1
    <107c>   DW_AT_decl_line   : 372
    <107e>   DW_AT_decl_column : 12
    <107f>   DW_AT_type        : <0xc50>
    <1083>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><1086>: Abbrev Number: 23 (DW_TAG_variable)
